

<!DOCTYPE html>
<html lang="zh-Hans">
<head prefix="og: http://ogp.me/ns#">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content="记录成长">
    <title>View的事件分发机制 | 陈华榕的个人博客</title>

    <!-- Open Graph -->
    <meta name="description" content="android&amp;#x7684;&amp;#x4E8B;&amp;#x4EF6;&amp;#x5206;&amp;#x53D1;&amp;#x673A;&amp;#x5236;&amp;#x5176;&amp;#x5B9E;&amp;#x8DDF;&amp;#x5B9E;&amp;#x73B0;&amp;#x4E2D;&amp;#x7684;&amp;#x5DE5;&amp;#x4F5C;&amp;#x6D41;&amp;#x7A0B;&amp;#x5F88;&amp;#x76F8;&amp;#x4F3C;&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;&amp;">
<meta property="og:type" content="article">
<meta property="og:title" content="View的事件分发机制">
<meta property="og:url" content="http://yoursite.com/2017/07/26/View的事件分发机制/index.html">
<meta property="og:site_name" content="陈华榕的个人博客">
<meta property="og:description" content="android&amp;#x7684;&amp;#x4E8B;&amp;#x4EF6;&amp;#x5206;&amp;#x53D1;&amp;#x673A;&amp;#x5236;&amp;#x5176;&amp;#x5B9E;&amp;#x8DDF;&amp;#x5B9E;&amp;#x73B0;&amp;#x4E2D;&amp;#x7684;&amp;#x5DE5;&amp;#x4F5C;&amp;#x6D41;&amp;#x7A0B;&amp;#x5F88;&amp;#x76F8;&amp;#x4F3C;&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;&amp;">
<meta property="og:locale" content="zh-Hans">
<meta property="og:updated_time" content="2017-07-26T14:08:59.464Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="View的事件分发机制">
<meta name="twitter:description" content="android&amp;#x7684;&amp;#x4E8B;&amp;#x4EF6;&amp;#x5206;&amp;#x53D1;&amp;#x673A;&amp;#x5236;&amp;#x5176;&amp;#x5B9E;&amp;#x8DDF;&amp;#x5B9E;&amp;#x73B0;&amp;#x4E2D;&amp;#x7684;&amp;#x5DE5;&amp;#x4F5C;&amp;#x6D41;&amp;#x7A0B;&amp;#x5F88;&amp;#x76F8;&amp;#x4F3C;&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;&amp;">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:undefined",
  "image": "undefined",
  "name": "陈华榕",
  "url": "http://yoursite.com"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>陈华榕的个人博客</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">陈华榕</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item" >
        <i class="home icon"></i>
        HOME
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-View的事件分发机制" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    View的事件分发机制
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <p>android&#x7684;&#x4E8B;&#x4EF6;&#x5206;&#x53D1;&#x673A;&#x5236;&#x5176;&#x5B9E;&#x8DDF;&#x5B9E;&#x73B0;&#x4E2D;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x6BD4;&#x5982;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E0B;&#x6765;&#xFF0C;&#x6700;&#x5148;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x662F;&#x6700;&#x9AD8;&#x5C42;&#x7684;&#x9886;&#x5BFC;&#xFF0C;&#x9886;&#x5BFC;&#x5982;&#x679C;&#x4E0D;&#x62E6;&#x622A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x4F1A;&#x628A;&#x95EE;&#x9898;&#x5411;&#x4E0B;&#x7EA7;&#x5206;&#x53D1;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x4EBA;&#x628A;&#x95EE;&#x9898;&#x5904;&#x7406;&#x6389;&#xFF0C;&#x6216;&#x8005;&#x5230;&#x6700;&#x540E;&#x4E00;&#x7EA7;&#x90FD;&#x4E0D;&#x5904;&#x7406;&#xFF0C;&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x5C31;&#x4F1A;&#x4EA4;&#x7ED9;&#x9886;&#x5BFC;&#x5904;&#x7406;&#xFF0C;&#x9886;&#x5BFC;&#x8FD8;&#x5904;&#x7406;&#x4E0D;&#x4E86;&#xFF0C;&#x5C31;&#x4F1A;&#x4EA4;&#x7ED9;&#x9886;&#x5BFC;&#x7684;&#x9886;&#x5BFC;&#x3002;&#x3002;&#x3002;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;V&#x5B57;&#x5F62;&#x3002;<br>&#x5E9F;&#x8BDD;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#xFF0C;&#x8FDB;&#x5165;&#x6B63;&#x9898;&#x3002;&#x3002;&#x3002;</p>
<h2 id="1&#x3001;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x7684;&#x4F20;&#x9012;&#x89C4;&#x5219;"><a href="#1&#x3001;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x7684;&#x4F20;&#x9012;&#x89C4;&#x5219;" class="headerlink" title="1&#x3001;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x7684;&#x4F20;&#x9012;&#x89C4;&#x5219;"></a>1&#x3001;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x7684;&#x4F20;&#x9012;&#x89C4;&#x5219;</h2><p>&#x5176;&#x5B9E;&#x5C31;&#x662F;MotionEvent&#x7684;&#x4F20;&#x9012;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x91CC;&#x7531;&#x4E09;&#x4E2A;&#x65B9;&#x6CD5;&#x6765;&#x5171;&#x540C;&#x5B8C;&#x6210;&#xFF1A;dispatchTouchEvent&#x548C;onInterceptTouchEvent&#x3001;onTouchEvent&#x3002;</p>
<h3 id="public-boolean-dispatchTouchEvent-MotionEvent-event"><a href="#public-boolean-dispatchTouchEvent-MotionEvent-event" class="headerlink" title="  public boolean dispatchTouchEvent(MotionEvent event) "></a><b>  public boolean dispatchTouchEvent(MotionEvent event) </b></h3><p>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x4E8B;&#x4EF6;&#x7684;&#x5206;&#x53D1;&#xFF0C;&#x5982;&#x679C;&#x4E8B;&#x4EF6;&#x80FD;&#x4F20;&#x9012;&#x5230;view&#xFF0C;&#x90A3;&#x4E48;view&#x7684;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4E00;&#x5B9A;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x5B83;&#x7684;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x53D7;&#x5230;&#x5F53;&#x524D;view&#x7684;onTouchEvent&#x548C;&#x4E0B;&#x7EA7;&#x7684;dispatchTouchEvent&#x65B9;&#x6CD5;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x8868;&#x793A;&#x662F;&#x5426;&#x6D88;&#x8017;&#x6389;&#x5F53;&#x524D;&#x4E8B;&#x4EF6;&#x3002;</p>
<h3 id="public-boolean-onInterceptTouchEvent-MotionEvent-event"><a href="#public-boolean-onInterceptTouchEvent-MotionEvent-event" class="headerlink" title="  public boolean onInterceptTouchEvent(MotionEvent event) "></a><b>  public boolean onInterceptTouchEvent(MotionEvent event) </b></h3><p>&#x5728;&#x4E0A;&#x8FF0;&#x65B9;&#x6CD5;&#x4E2D;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x7528;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x62E6;&#x622A;&#x5F53;&#x524D;&#x4E8B;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;view&#x62E6;&#x622A;&#x4E2A;&#x67D0;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#x4E2D;&#xFF0C;&#x6B64;&#x65B9;&#x6CD5;&#x4E0D;&#x4F1A;&#x88AB;&#x518D;&#x6B21;&#x8C03;&#x7528;&#xFF0C;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x8868;&#x793A;&#x662F;&#x5426;&#x62E6;&#x622A;&#x5F53;&#x524D;&#x4E8B;&#x4EF6;&#x3002;</p>
<h3 id="public-boolean-onTouchEvent-MotionEvent-event"><a href="#public-boolean-onTouchEvent-MotionEvent-event" class="headerlink" title="  public boolean onTouchEvent(MotionEvent event) "></a><b>  public boolean onTouchEvent(MotionEvent event) </b></h3><p>&#x5728;dispatchTouchEvent&#x65B9;&#x6CD5;&#x4E2D;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x7528;&#x6765;&#x5904;&#x7406;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#xFF0C;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x8868;&#x793A;&#x662F;&#x5426;&#x6D88;&#x8017;&#x5F53;&#x524D;&#x4E8B;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6D88;&#x8017;&#xFF0C;&#x90A3;&#x4E48;&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#x4E2D;&#xFF0C;&#x5F53;&#x524D;view&#x65E0;&#x6CD5;&#x518D;&#x63A5;&#x6536;&#x5230;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x4E0A;&#x8FF0;&#x4E09;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x5173;&#x7CFB;&#x7528;&#x5982;&#x4E0B;&#x4F2A;&#x4EE3;&#x7801;&#x8868;&#x793A;&#xFF1A;<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div></pre></td><td class="code"><pre><div class="line">public boolean dispatchTouchEvent(MotionEvent event) {</div><div class="line">        boolean consume = false;</div><div class="line">        if(onIntercepTouchEvent(event)){</div><div class="line">            consume = onTouchEvent(event);</div><div class="line">        } else {</div><div class="line">            consume = child.dispatchTouchEvent(event);</div><div class="line">        }</div><div class="line">        return consume;</div><div class="line">}</div></pre></td></tr></table></figure></p>
<p>&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x4F2A;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x5927;&#x81F4;&#x4E86;&#x89E3;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x7684;&#x4F20;&#x9012;&#x89C4;&#x5219;&#xFF1A;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6839;viewgroup&#x6765;&#x8BF4;&#xFF0C;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x4EA7;&#x751F;&#x540E;&#xFF0C;&#x9996;&#x5148;&#x4F1A;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#xFF0C;&#x8FD9;&#x65F6;&#x5B83;&#x7684;dispatchTouchEvent&#x65B9;&#x6CD5;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;viewgroup&#x7684;onIntercepTouchEvent&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;true&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x5C31;&#x4F1A;&#x7531;&#x5B83;&#x7684;onTouchEvent&#x65B9;&#x6CD5;&#x6D88;&#x8017;&#x6389;&#xFF0C;&#x5426;&#x5219;&#x5B83;&#x4F1A;&#x5C06;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x4F20;&#x9012;&#x4E0B;&#x53BB;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;view&#x9700;&#x8981;&#x5904;&#x7406;&#x4E8B;&#x4EF6;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x8BBE;&#x7F6E;&#x4E86;OnTouchListener&#xFF0C;&#x90A3;&#x4E48;OnTouchListener&#x4E2D;&#x7684;onTouch&#x65B9;&#x6CD5;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x65F6;&#x4E8B;&#x4EF6;&#x5982;&#x4F55;&#x5904;&#x7406;&#x8FD8;&#x8981;&#x770B;onTouch&#x7684;&#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x8FD4;&#x56DE;false,&#x5219;&#x5F53;&#x524D;view&#x7684;onTouchEvent&#x65B9;&#x6CD5;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x8FD4;&#x56DE;true&#xFF0C;&#x90A3;&#x4E48;onTouchEvent&#x65B9;&#x6CD5;&#x5C06;&#x4E0D;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5E73;&#x65F6;&#x6211;&#x4EEC;&#x5E38;&#x7528;&#x7684;OnClickListener&#xFF0C;&#x5176;&#x4F18;&#x5148;&#x7EA7;&#x6700;&#x4F4E;&#xFF0C;&#x5373;&#x5904;&#x4E8E;&#x4E8B;&#x4EF6;&#x4F20;&#x9012;&#x7684;&#x5C3E;&#x7AEF;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x4EA7;&#x751F;&#x540E;&#xFF0C;&#x5B83;&#x7684;&#x4F20;&#x9012;&#x8FC7;&#x7A0B;&#x9075;&#x5FAA;&#x5982;&#x4E0B;&#x987A;&#x5E8F;&#xFF1A;Activity -&gt;Window -&gt;View&#xFF0C;&#x5373;&#x4E8B;&#x4EF6;&#x603B;&#x662F;&#x5148;&#x4F20;&#x9012;&#x7ED9;Activity&#xFF0C;Activity&#x518D;&#x4F20;&#x9012;&#x7ED9;window&#xFF0C;&#x6700;&#x540E;Window&#x518D;&#x4F20;&#x9012;&#x7ED9;&#x9876;&#x7EA7;View&#xFF0C;&#x9876;&#x7EA7;View&#x63A5;&#x6536;&#x4E8B;&#x4EF6;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x6309;&#x7167;&#x4E8B;&#x4EF6;&#x5206;&#x53D1;&#x673A;&#x5236;&#x53BB;&#x5206;&#x53D1;&#x4E8B;&#x4EF6;&#x3002;&#x8003;&#x8651;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;View&#x7684;onTouchEvent&#x8FD4;&#x56DE;false&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;&#x7236;&#x5BB9;&#x5668;&#x7684;onTouchEvent&#x5C06;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x5982;&#x679C;&#x6240;&#x6709;&#x7684;&#x5143;&#x7D20;&#x90FD;&#x4E0D;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x5C06;&#x4F1A;&#x6700;&#x7EC8;&#x4F20;&#x9012;&#x7ED9;Activity&#x5904;&#x7406;&#xFF0C;&#x5373;Activity&#x7684;onTouchEvent&#x65B9;&#x6CD5;&#x4F1A;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5176;&#x5B9E;&#x4E5F;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6362;&#x4E00;&#x79CD;&#x601D;&#x8DEF;&#xFF0C;&#x5047;&#x5982;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x662F;&#x4E00;&#x4E2A;&#x96BE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x96BE;&#x9898;&#x6700;&#x7EC8;&#x88AB;&#x4E0A;&#x7EA7;&#x9886;&#x5BFC;&#x5206;&#x7ED9;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x53BB;&#x5904;&#x7406;&#xFF08;&#x8FD9;&#x662F;&#x4E8B;&#x4EF6;&#x5206;&#x53D1;&#x8FC7;&#x7A0B;&#xFF09;&#xFF0C;&#x7ED3;&#x679C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x641E;&#x4E0D;&#x5B9A;(onTouchEvent&#x8FD4;&#x56DE;&#x4E86;false)&#xFF0C;&#x73B0;&#x5728;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x96BE;&#x9898;&#x5FC5;&#x987B;&#x8981;&#x89E3;&#x51B3;&#xFF0C;&#x90A3;&#x53EA;&#x80FD;&#x4EA4;&#x7ED9;&#x6C34;&#x5E73;&#x66F4;&#x9AD8;&#x7684;&#x4E0A;&#x7EA7;&#x89E3;&#x51B3;&#xFF08;&#x4E0A;&#x7EA7;&#x7684;onTouchEvent&#x88AB;&#x8C03;&#x7528;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x4E0A;&#x7EA7;&#x518D;&#x641E;&#x4E0D;&#x5B9A;&#xFF0C;&#x90A3;&#x53EA;&#x80FD;&#x4EA4;&#x7ED9;&#x4E0A;&#x7EA7;&#x7684;&#x4E0A;&#x7EA7;&#x53BB;&#x89E3;&#x51B3;&#xFF0C;&#x5C31;&#x8FD9;&#x6837;&#x5C06;&#x96BE;&#x9898;&#x4E00;&#x5C42;&#x5C42;&#x5730;&#x5411;&#x4E0A;&#x629B;&#xFF0C;&#x8FD9;&#x662F;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x4E00;&#x79CD;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x5904;&#x7406;&#x95EE;&#x9898;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;View&#x7684;&#x4E8B;&#x4EF6;&#x4F20;&#x9012;&#x8FC7;&#x7A0B;&#x8FD8;&#x662F;&#x5F88;&#x8D34;&#x8FD1;&#x73B0;&#x5B9E;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x7A0B;&#x5E8F;&#x5458;&#x4E5F;&#x751F;&#x6D3B;&#x5728;&#x73B0;&#x5B9E;&#x4E2D;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x4E8B;&#x4EF6;&#x4F20;&#x9012;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x8FD9;&#x91CC;&#x7ED9;&#x51FA;&#x4E00;&#x4E9B;&#x7ED3;&#x8BBA;&#xFF0C;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x7ED3;&#x8BBA;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x6574;&#x4E2A;&#x4F20;&#x9012;&#x673A;&#x5236;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<pre><code>&#xFF08;1&#xFF09;&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#x662F;&#x6307;&#x4ECE;&#x624B;&#x6307;&#x63A5;&#x89E6;&#x5C4F;&#x5E55;&#x7684;&#x90A3;&#x4E00;&#x8BE5;&#x8D70;&#xFF0C;&#x5230;&#x624B;&#x6307;&#x79BB;&#x5F00;&#x5C4F;&#x5E55;&#x7684;&#x90A3;&#x4E00;&#x8BE5;&#x7ED3;&#x675F;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x4E8B;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#x4EE5;down&#x4E8B;&#x4EF6;&#x5F00;&#x59CB;&#xFF0C;&#x4E2D;&#x95F4;&#x542B;&#x6709;&#x6570;&#x91CF;&#x4E0D;&#x5B9A;&#x7684;move&#x4E8B;&#x4EF6;&#xFF0C;&#x6700;&#x7EC8;&#x4EE5;up&#x4E8B;&#x4EF6;&#x7ED3;&#x675F;&#x3002;
&#xFF08;2&#xFF09;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#x53EA;&#x80FD;&#x88AB;&#x4E00;&#x4E2A;View&#x62E6;&#x622A;&#x4E14;&#x6D88;&#x8017;&#x3002;&#x8FD9;&#x4E00;&#x6761;&#x7684;&#x539F;&#x56E0;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#xFF08;3&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x62E6;&#x622A;&#x4E86;&#x6B64;&#x4E8B;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#x5185;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x4EF6;&#x90FD;&#x4F1A;&#x76F4;&#x63A5;&#x4EA4;&#x7ED9;&#x5B83;&#x5904;&#x7406;&#xFF0C;&#x56E0;&#x6B64;&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x4E8B;&#x4EF6;&#x4E0D;&#x80FD;&#x5206;&#x522B;&#x7531;&#x4E24;&#x4E2A;View&#x5904;&#x7406;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;&#x7279;&#x6B8A;&#x624B;&#x6BB5;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;View&#x5C06;&#x672C;&#x8BE5;&#x81EA;&#x5DF1;&#x5904;&#x7406;&#x7684;&#x4E8B;&#x4EF6;&#x901A;&#x8FC7;onTouchEvent&#x5F3A;&#x884C;&#x4F20;&#x9012;&#x7ED9;&#x5176;&#x4ED6;View&#x5904;&#x7406;&#x3002;
&#xFF08;3&#xFF09;&#x67D0;&#x4E2A;View&#x4E00;&#x65E6;&#x51B3;&#x5B9A;&#x62E6;&#x622A;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#x90FD;&#x53EA;&#x80FD;&#x7531;&#x5B83;&#x6765;&#x5904;&#x7406;&#xFF08;&#x5982;&#x679C;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#x80FD;&#x591F;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#x7684;&#x8BDD;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x7684;onInterceptTouchEvent&#x4E0D;&#x4F1A;&#x518D;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x6761;&#x4E5F;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x5F53;&#x4E00;&#x4E2A;View&#x51B3;&#x5B9A;&#x62E6;&#x622A;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x540E;&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x4F1A;&#x628A;&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#x5185;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x90FD;&#x76F4;&#x63A5;&#x4EA4;&#x7ED9;&#x5B83;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x56E0;&#x6B64;&#x5C31;&#x4E0D;&#x7528;&#x518D;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;View&#x7684;onInterceptTouchEvent&#x53BB;&#x8BE2;&#x95EE;&#x5B83;&#x662F;&#x5426;&#x8981;&#x62E6;&#x622A;&#x4E86;&#x3002;
&#xFF08;4&#xFF09;&#x67D0;&#x4E2A;View&#x4E00;&#x65E6;&#x5F00;&#x59CB;&#x5904;&#x7406;&#x4E8B;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x4E0D;&#x6D88;&#x8017;ACTION_DOWN&#x4E8B;&#x4EF6;&#xFF08;onTouchEvent&#x8FD4;&#x56DE;&#x4E86;false&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x540C;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x4E8B;&#x4EF6;&#x90FD;&#x4E0D;&#x4F1A;&#x518D;&#x4EA4;&#x7ED9;&#x5B83;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x4E14;&#x4E8B;&#x4EF6;&#x5C06;&#x91CD;&#x65B0;&#x4EA4;&#x7531;&#x5B83;&#x7684;&#x7236;&#x5143;&#x7D20;&#x53BB;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x4E14;&#x4E8B;&#x4EF6;&#x5C06;&#x91CD;&#x65B0;&#x4EA4;&#x7531;&#x5B83;&#x7684;&#x7236;&#x5143;&#x7D20;&#x5904;&#x7406;&#xFF0C;&#x5373;&#x7236;&#x5143;&#x7D20;&#x7684;onTouchEvent&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x4E8B;&#x4EF6;&#x4E00;&#x65E6;&#x4EA4;&#x7ED9;&#x4E00;&#x4E2A;View&#x5904;&#x7406;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x5FC5;&#x987B;&#x6D88;&#x8017;&#x6389;&#xFF0C;&#x5426;&#x5219;&#x540C;&#x4E00;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#x4E2D;&#x5269;&#x4E0B;&#x7684;&#x4E8B;&#x4EF6;&#x5C31;&#x4E0D;&#x518D;&#x4EA4;&#x7ED9;&#x5B83;&#x6765;&#x5904;&#x7406;&#x4E86;&#xFF0C;&#x8FD9;&#x5C31;&#x597D;&#x6BD4;&#x4E0A;&#x7EA7;&#x4EA4;&#x7ED9;&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4EF6;&#x4E8B;&#x6CA1;&#x6709;&#x5904;&#x7406;&#x597D;&#xFF0C;&#x77ED;&#x671F;&#x5185;&#x4E0A;&#x7EA7;&#x5C31;&#x4E0D;&#x6562;&#x518D;&#x628A;&#x4E8B;&#x4EF6;&#x4EA4;&#x7ED9;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x505A;&#x4E86;&#xFF0C;&#x4E8C;&#x8005;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#x9053;&#x7406;&#x3002;
&#xFF08;5&#xFF09;&#x5982;&#x679C;View&#x4E0D;&#x6D88;&#x8017;&#x9664;ACTION_DOWN&#x4EE5;&#x5916;&#x7684;&#x5176;&#x4ED6;&#x4E8B;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x4F1A;&#x6D88;&#x5931;&#xFF0C;&#x6B64;&#x65F6;&#x7236;&#x5143;&#x7D20;&#x7684;onTouchEvent&#x5E76;&#x4E0D;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x524D;View&#x53EF;&#x4EE5;&#x6301;&#x7EED;&#x6536;&#x5230;&#x540E;&#x7EED;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x6700;&#x7EC8;&#x8FD9;&#x4E9B;&#x6D88;&#x5931;&#x7684;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x4F1A;&#x4F20;&#x9012;&#x7ED9;Activity&#x5904;&#x7406;&#x3002;
&#xFF08;6&#xFF09;ViewGroup&#x9ED8;&#x8BA4;&#x4E0D;&#x62E6;&#x622A;&#x4EFB;&#x4F55;&#x4E8B;&#x4EF6;&#x3002;Android&#x6E90;&#x7801;&#x4E2D;ViewGroup&#x7684;onInterceptTouchEvent&#x65B9;&#x6CD5;&#x9ED8;&#x8BA4;&#x8FD4;&#x56DE;false&#x3002;
&#xFF08;7&#xFF09;View&#x6CA1;&#x6709;onIntercepTouchEvent&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x65E6;&#x6709;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;onTouchEvent&#x65B9;&#x6CD5;&#x9ED8;&#x8BA4;&#x8FD4;&#x56DE;false&#x3002;
&#xFF08;8&#xFF09;View&#x7684;onTouchEvent&#x9ED8;&#x8BA4;&#x90FD;&#x4F1A;&#x6D88;&#x8017;&#x4E8B;&#x4EF6;&#xFF08;&#x8FD4;&#x56DE;true&#xFF09;&#xFF0C;&#x9664;&#x975E;&#x5B83;&#x662F;&#x4E0D;&#x53EF;&#x70B9;&#x51FB;&#x7684;&#xFF08;clickable&#x548C;longClickable&#x540C;&#x65F6;&#x4E3A;false&#xFF09;&#x3002;View&#x7684;longClickable&#x5C5E;&#x6027;&#x9ED8;&#x8BA4;&#x90FD;&#x4E3A;false&#xFF0C;clickable&#x5C5E;&#x6027;&#x8981;&#x5206;&#x60C5;&#x51B5;&#xFF0C;&#x6BD4;&#x5982;Button&#x7684;clickable&#x5C5E;&#x6027;&#x9ED8;&#x8BA4;&#x4E3A;true&#xFF0C;&#x800C;TextView&#x7684;clickable&#x5C5E;&#x6027;&#x9ED8;&#x8BA4;&#x4E3A;false&#x3002;
&#xFF08;9&#xFF09;View&#x7684;enable&#x5C5E;&#x6027;&#x4E0D;&#x5F71;&#x54CD;onTouchEvent&#x7684;&#x9ED8;&#x8BA4;&#x8FD4;&#x56DE;&#x503C;&#x3002;&#x54EA;&#x6015;&#x4E00;&#x4E2A;View&#x662F;disable&#x72B6;&#x6001;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x5B83;&#x7684;clickable&#x6216;&#x8005;longClickable&#x6709;&#x4E00;&#x4E2A;&#x4E3A;true&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;onTouchEvent&#x5C31;&#x8FD4;&#x56DE;true&#x3002;
&#xFF08;10&#xFF09;onClick&#x4F1A;&#x53D1;&#x751F;&#x7684;&#x524D;&#x63D0;&#x662F;&#x5F53;&#x524D;View&#x662F;&#x53EF;&#x70B9;&#x51FB;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x6536;&#x5230;&#x4E86;down&#x548C;up&#x7684;&#x4E8B;&#x4EF6;&#x3002;
&#xFF08;11&#xFF09;&#x4E8B;&#x4EF6;&#x4F20;&#x9012;&#x8FC7;&#x7A0B;&#x662F;&#x7531;&#x5916;&#x5411;&#x5185;&#x7684;&#xFF0C;&#x5373;&#x4E8B;&#x4EF6;&#x603B;&#x5148;&#x4F20;&#x9012;&#x7ED9;&#x7236;&#x5143;&#x7D20;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7531;&#x7236;&#x5143;&#x7D20;&#x5206;&#x53D1;&#x7ED9;&#x5B50;View&#xFF0C;&#x901A;&#x8FC7;requestDisallowInterceptTouchEvent&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5728;&#x5B50;&#x5143;&#x7D20;&#x4E2D;&#x5E72;&#x9884;&#x7236;&#x5143;&#x7D20;&#x7684;&#x4E8B;&#x4EF6;&#x5206;&#x53D1;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;ACTION_DOWN&#x4E8B;&#x4EF6;&#x9664;&#x5916;&#x3002;
</code></pre>
                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2017-07-26T14:08:59.004Z" itemprop="datePublished">2017-07-26</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a class="ui tiny button disabled"><i class="angle left icon"></i>Previous</a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/2017/07/23/android页面跳转速度优化/" class="ui tiny button">
                    
                    android页面跳转速度优化
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    <ol class="ui ordered list"><li><a href="#1、点击事件的传递规则"><span>1、点击事件的传递规则</span></a><ol><li><a href="#public-boolean-dispatchTouchEvent-MotionEvent-event"><span>  public boolean dispatchTouchEvent(MotionEvent event) </span></a></li><li><a href="#public-boolean-onInterceptTouchEvent-MotionEvent-event"><span>  public boolean onInterceptTouchEvent(MotionEvent event) </span></a></li><li><a href="#public-boolean-onTouchEvent-MotionEvent-event"><span>  public boolean onTouchEvent(MotionEvent event) </span></a></li></ol></li></ol>
                </div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2017 <a href="/">陈华榕</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a
                href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/js/semantic-ui-algolia.js"></script>

<script src="/js/aloha-events.js"></script>



</body>
</html>
