

<!DOCTYPE html>
<html lang="zh-Hans">
<head prefix="og: http://ogp.me/ns#">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content="记录成长">
    <title>非常一般人 | 陈华榕的个人博客</title>

    <!-- Open Graph -->
    <meta name="description" content="&amp;#x89C6;&amp;#x9891;&amp;#x683C;&amp;#x5F0F;&amp;#x57FA;&amp;#x7840;  &amp;#x6700;&amp;#x8FD1;&amp;#x9879;&amp;#x76EE;&amp;#x4E2D;&amp;#x5B9E;&amp;#x73B0;&amp;#x4E86;&amp;#x77ED;&amp;#x89C6;&amp;#x9891;&amp;#x7684;&amp;#x529F;&amp;#x80FD;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8981;&amp;#x5305;&amp;#x62">
<meta property="og:type" content="article">
<meta property="og:title" content="陈华榕的个人博客">
<meta property="og:url" content="http://yoursite.com/2017/10/30/视频格式基础/index.html">
<meta property="og:site_name" content="陈华榕的个人博客">
<meta property="og:description" content="&amp;#x89C6;&amp;#x9891;&amp;#x683C;&amp;#x5F0F;&amp;#x57FA;&amp;#x7840;  &amp;#x6700;&amp;#x8FD1;&amp;#x9879;&amp;#x76EE;&amp;#x4E2D;&amp;#x5B9E;&amp;#x73B0;&amp;#x4E86;&amp;#x77ED;&amp;#x89C6;&amp;#x9891;&amp;#x7684;&amp;#x529F;&amp;#x80FD;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8981;&amp;#x5305;&amp;#x62">
<meta property="og:locale" content="zh-Hans">
<meta property="og:updated_time" content="2017-10-30T14:10:17.007Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="陈华榕的个人博客">
<meta name="twitter:description" content="&amp;#x89C6;&amp;#x9891;&amp;#x683C;&amp;#x5F0F;&amp;#x57FA;&amp;#x7840;  &amp;#x6700;&amp;#x8FD1;&amp;#x9879;&amp;#x76EE;&amp;#x4E2D;&amp;#x5B9E;&amp;#x73B0;&amp;#x4E86;&amp;#x77ED;&amp;#x89C6;&amp;#x9891;&amp;#x7684;&amp;#x529F;&amp;#x80FD;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8981;&amp;#x5305;&amp;#x62">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:undefined",
  "image": "undefined",
  "name": "陈华榕",
  "url": "http://yoursite.com"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>陈华榕的个人博客</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">陈华榕</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item" >
        <i class="home icon"></i>
        HOME
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-视频格式基础" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <hr>
<p>&#x89C6;&#x9891;&#x683C;&#x5F0F;&#x57FA;&#x7840;</p>
<p> &#x6700;&#x8FD1;&#x9879;&#x76EE;&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;&#x77ED;&#x89C6;&#x9891;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x89C6;&#x9891;&#x7684;&#x7F16;&#x8F91;&#x5904;&#x7406;&#x3001;&#x4E0A;&#x4F20;&#x548C;&#x64AD;&#x653E;&#x3002;&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x771F;&#x6B63;&#x7565;&#x6DF1;&#x5165;&#x7684;&#x63A5;&#x89E6;&#x89C6;&#x9891;&#x5F00;&#x53D1;&#xFF0C;&#x9879;&#x76EE;&#x4E2D;&#x63A5;&#x89E6;&#x5230;&#x8BB8;&#x591A;&#x65B0;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E5F;&#x8E29;&#x4E86;&#x5F88;&#x591A;&#x5751;&#xFF0C;&#x6574;&#x4F53;&#x611F;&#x89C9;&#x89C6;&#x9891;&#x5904;&#x7406;&#x8FD8;&#x662F;&#x5341;&#x5206;&#x590D;&#x6742;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF0C;&#x9700;&#x8981;&#x82B1;&#x5927;&#x91CF;&#x7684;&#x7CBE;&#x529B;&#x548C;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x638C;&#x63E1;&#x8FD9;&#x9879;&#x6280;&#x672F;&#x3002;<br>       &#x4E0B;&#x9762;&#x5C31;&#x8C08;&#x4E00;&#x8C08;&#x5176;&#x4E2D;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x5185;&#x5BB9;&#xFF0C;&#x4E5F;&#x4F5C;&#x4E3A;&#x5BF9;&#x4E4B;&#x524D;&#x5DE5;&#x4F5C;&#x7684;&#x56DE;&#x987E;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x6982;&#x5FF5;<br>&#x7801;&#x7387;<br>       &#x7801;&#x7387;&#x5C31;&#x662F;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x65F6;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x4F20;&#x9001;&#x7684;&#x6570;&#x636E;&#x4F4D;&#x6570;&#xFF0C;&#x5355;&#x4F4D;&#x4E00;&#x822C;&#x662F;kbps&#x5373;&#x5343;&#x4F4D;&#x6BCF;&#x79D2;&#x3002;&#x7801;&#x7387;&#x5F71;&#x54CD;&#x4F53;&#x79EF;&#xFF0C;&#x4E0E;&#x4F53;&#x79EF;&#x6210;&#x6B63;&#x6BD4;&#xFF1A;&#x7801;&#x7387;&#x8D8A;&#x5927;&#xFF0C;&#x4F53;&#x79EF;&#x8D8A;&#x5927;&#xFF1B;&#x7801;&#x7387;&#x8D8A;&#x5C0F;&#xFF0C;&#x4F53;&#x79EF;&#x8D8A;&#x5C0F;&#x3002;&#x7801;&#x7387;&#x8FD8;&#x5F71;&#x54CD;&#x6E05;&#x6670;&#x5EA6;&#xFF0C;&#x7801;&#x7387;&#x8D8A;&#x9AD8;&#x6E05;&#x6670;&#x5EA6;&#x4E5F;&#x5C31;&#x8D8A;&#x9AD8;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x7801;&#x7387;&#x8D85;&#x8FC7;&#x4E00;&#x5B9A;&#x6570;&#x503C;&#xFF0C;&#x5BF9;&#x56FE;&#x50CF;&#x7684;&#x8D28;&#x91CF;&#x6CA1;&#x6709;&#x591A;&#x5927;&#x5F71;&#x54CD;&#x3002;&#x901A;&#x5E38;&#x6765;&#x8BB2;&#xFF0C;&#x4F53;&#x79EF;=&#x7801;&#x7387;&#xD7;&#x65F6;&#x95F4;&#xFF0C;&#x7531;&#x4E8E;&#x6709;&#x5176;&#x4ED6;&#x56E0;&#x7D20;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x4F1A;&#x7A0D;&#x5FAE;&#x6709;&#x4E00;&#x4E9B;&#x8BEF;&#x5DEE;&#x3002;&#x7801;&#x7387;&#x4E5F;&#x5C31;&#x662F;&#x91C7;&#x6837;&#x7387;&#xFF08;&#x5E76;&#x4E0D;&#x7B49;&#x540C;&#x4E8E;&#x91C7;&#x6837;&#x7387;&#xFF0C;&#x91C7;&#x6837;&#x7387;&#x7684;&#x5355;&#x4F4D;&#x662F;Hz&#xFF0C;&#x8868;&#x793A;&#x6BCF;&#x79D2;&#x91C7;&#x6837;&#x7684;&#x6B21;&#x6570;&#xFF09;&#xFF0C;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x91C7;&#x6837;&#x7387;&#x8D8A;&#x5927;&#xFF0C;&#x7CBE;&#x5EA6;&#x5C31;&#x8D8A;&#x9AD8;&#xFF0C;&#x5904;&#x7406;&#x51FA;&#x6765;&#x7684;&#x6587;&#x4EF6;&#x5C31;&#x8D8A;&#x63A5;&#x8FD1;&#x539F;&#x59CB;&#x6587;&#x4EF6;&#x3002;&#x4F46;&#x662F;&#x6587;&#x4EF6;&#x4F53;&#x79EF;&#x4E0E;&#x53D6;&#x6837;&#x7387;&#x662F;&#x6210;&#x6B63;&#x6BD4;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x91CD;&#x89C6;&#x7684;&#x90FD;&#x662F;&#x5982;&#x4F55;&#x7528;&#x6700;&#x4F4E;&#x7684;&#x7801;&#x7387;&#x8FBE;&#x5230;&#x6700;&#x5C11;&#x7684;&#x5931;&#x771F;&#xFF0C;&#x56F4;&#x7ED5;&#x8FD9;&#x4E2A;&#x6838;&#x5FC3;&#x884D;&#x751F;&#x51FA;&#x6765;cbr&#xFF08;&#x56FA;&#x5B9A;&#x7801;&#x7387;&#xFF09;&#x4E0E;vbr&#xFF08;&#x53EF;&#x53D8;&#x7801;&#x7387;&#xFF09;&#x3002;<br>       &#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x5305;&#x62EC;&#x753B;&#x9762;&#x548C;&#x58F0;&#x97F3;&#xFF0C;&#x97F3;&#x9891;&#x53CA;&#x89C6;&#x9891;&#x90FD;&#x6709;&#x5404;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x7801;&#x7387;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x97F3;&#x9891;&#x548C;&#x89C6;&#x9891;&#x7684;&#x7801;&#x7387;&#x5E76;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x800C;&#x901A;&#x5E38;&#x6240;&#x8BF4;&#x7684;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x7801;&#x7387;&#x5927;&#x5C0F;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x6307;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x4E2D;&#x97F3;&#x9891;&#x548C;&#x89C6;&#x9891;&#x7801;&#x7387;&#x7684;&#x603B;&#x548C;&#x3002;</p>
<pre><code>CBR &#x7F16;&#x7801; &#xFF08;Constant Bitrate&#xFF09;
CBR &#x7F16;&#x7801;&#x662F;&#x4E00;&#x79CD;&#x9759;&#x6001;&#x7801;&#x7387;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x90FD;&#x662F;&#x6052;&#x5B9A;&#x7801;&#x7387;&#x3002;
&#x5B83;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x8FD0;&#x7B97;&#x91CF;&#x5C0F;&#xFF0C;&#x538B;&#x7F29;&#x5FEB;&#xFF0C;&#x80FD;&#x88AB;&#x5927;&#x591A;&#x6570;&#x8F6F;&#x4EF6;&#x548C;&#x8BBE;&#x5907;&#x652F;&#x6301;&#xFF0C;&#x7F3A;&#x70B9;&#x662F;&#x5360;&#x7528;&#x7A7A;&#x95F4;&#x76F8;&#x5BF9;&#x5927;&#xFF0C;&#x538B;&#x7F29;&#x51FA;&#x6765;&#x7684;&#x89C6;&#x9891;&#x753B;&#x8D28;&#x8F83;&#x5DEE;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x5728;&#x753B;&#x9762;&#x5267;&#x70C8;&#x8FD0;&#x52A8;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x7531;&#x4E8E;&#x7801;&#x7387;&#x4E0D;&#x591F;&#x800C;&#x4E22;&#x5931;&#x90E8;&#x5206;&#x753B;&#x9762;&#x4FE1;&#x606F;&#xFF0C;&#x4ECE;&#x89C6;&#x89C9;&#x4E0A;&#x6765;&#x770B;&#x5C31;&#x662F;&#x753B;&#x9762;&#x6CE2;&#x7EB9;&#x4E25;&#x91CD;&#xFF0C;&#x56FE;&#x50CF;&#x4E0D;&#x6E05;&#x6670;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5408;&#x6210;&#x76F8;&#x540C;&#x8D28;&#x91CF;&#x7684;&#x8282;&#x76EE;&#x65F6;&#xFF0C;&#x91C7;&#x7528;CBR&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x65F6;&#x8282;&#x76EE;&#x5408;&#x6210;&#x65F6;&#x95F4;&#x4F1A;&#x77ED;&#x4E00;&#x4E9B;&#xFF0C;&#x4F46;&#x6587;&#x4EF6;&#x7684;&#x957F;&#x5EA6;&#x4F1A;&#x5927;&#x4E00;&#x4E9B;&#x3002;

VBR &#x7F16;&#x7801; &#xFF08;Variable Bitrate&#xFF09;
&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x52A8;&#x6001;&#x7801;&#x7387;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x56FA;&#x5B9A;&#x7684;&#x6BD4;&#x7279;&#x7387;&#xFF0C;&#x7F16;&#x7801;&#x7B97;&#x6CD5;&#x6839;&#x636E;&#x89C6;&#x9891;&#x5185;&#x5BB9;&#x7684;&#x53D8;&#x5316;&#x6765;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x65F6;&#x7801;&#x7387;&#x5BF9;&#x89C6;&#x9891;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x628A;&#x8F83;&#x9AD8;&#x7684;&#x7801;&#x7387;&#x7528;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x52A8;&#x6001;&#x753B;&#x9762;&#xFF0C;&#x800C;&#x628A;&#x8F83;&#x4F4E;&#x7684;&#x7801;&#x7387;&#x7528;&#x4E8E;&#x9759;&#x6001;&#x753B;&#x9762;&#xFF0C;&#x5408;&#x7406;&#x5229;&#x7528;&#x8D44;&#x6E90;&#xFF0C;&#x8FBE;&#x5230;&#x753B;&#x8D28;&#x8F83;&#x9AD8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F53;&#x79EF;&#x4E5F;&#x8F83;&#x5C0F;&#x3002;&#x5F53;&#x89C6;&#x9891;&#x5185;&#x5BB9;&#x7684;&#x753B;&#x9762;&#x53D8;&#x5316;&#x5FFD;&#x5927;&#x5FFD;&#x5C0F;&#x65F6;&#xFF0C;VBR &#x7F16;&#x7801;&#x662F;&#x5F88;&#x6709;&#x4F18;&#x52BF;&#x7684;&#x3002;&#x4F7F;&#x7528; VBR &#x7F16;&#x7801;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x81EA;&#x52A8;&#x4E3A;&#x5185;&#x5BB9;&#x7684;&#x7B80;&#x5355;&#x90E8;&#x5206;&#x5206;&#x914D;&#x8F83;&#x5C11;&#x7684;&#x6BD4;&#x7279;&#xFF0C;&#x4ECE;&#x800C;&#x7559;&#x51FA;&#x8DB3;&#x91CF;&#x7684;&#x6BD4;&#x7279;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x590D;&#x6742;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x590D;&#x6742;&#x6027;&#x6052;&#x5B9A;&#x7684;&#x5185;&#x5BB9;&#x4E0D;&#x4F1A;&#x53D7;&#x76CA;&#x4E8E; VBR &#x7F16;&#x7801;&#x3002;&#x5BF9;&#x6DF7;&#x5408;&#x5185;&#x5BB9;&#x4F7F;&#x7528; VBR &#x7F16;&#x7801;&#x65F6;&#xFF0C;&#x5728;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x76F8;&#x540C;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;VBR &#x7F16;&#x7801;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x8981;&#x6BD4; CBR &#x7F16;&#x7801;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x8D28;&#x91CF;&#x597D;&#x5F97;&#x591A;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0E; CBR &#x7F16;&#x7801;&#x6587;&#x4EF6;&#x8D28;&#x91CF;&#x76F8;&#x540C;&#x7684; VBR &#x7F16;&#x7801;&#x6587;&#x4EF6;&#xFF0C;&#x5176;&#x4F53;&#x79EF;&#x5927;&#x5C0F;&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x524D;&#x8005;&#x7684;&#x4E00;&#x534A;&#x3002;
VBR&#x7684;&#x4F18;&#x70B9;&#x5C31;&#x4F53;&#x73B0;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x753B;&#x9762;&#x8D28;&#x91CF;&#x76F8;&#x5BF9;&#x9AD8;&#xFF0C;&#x6587;&#x4EF6;&#x4F53;&#x79EF;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x7F3A;&#x70B9;&#x4E5F;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x7F16;&#x7801;&#x7684;&#x7B97;&#x6CD5;&#x8981;&#x590D;&#x6742;&#x5F88;&#x591A;&#xFF0C;&#x8FD0;&#x7B97;&#x91CF;&#x5927;&#xFF0C;&#x538B;&#x7F29;&#x65F6;&#x95F4;&#x957F;&#x3002;
</code></pre><p>&#x5E27;&#x7387;<br>        &#x5E27;&#x7387;&#x6216;&#x8005;&#x79F0;FPS&#xFF08;Frames Per Second&#xFF0C;&#x5E27;/&#x79D2;&#xFF09;&#xFF0C;&#x662F;&#x6307;&#x6BCF;&#x79D2;&#x663E;&#x793A;&#x7684;&#x56FE;&#x7247;&#x6570;&#xFF0C;&#x6216;&#x8005;GPU&#x5904;&#x7406;&#x65F6;&#x6BCF;&#x79D2;&#x80FD;&#x591F;&#x66F4;&#x65B0;&#x7684;&#x6B21;&#x6570;&#x3002;&#x8D8A;&#x9AD8;&#x7684;&#x5E27;&#x901F;&#x7387;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x66F4;&#x6D41;&#x7545;&#x903C;&#x771F;&#x7684;&#x753B;&#x9762;&#x3002;&#x6BCF;&#x79D2;&#x949F;&#x5E27;&#x6570;&#x8D8A;&#x591A;&#xFF0C;&#x6240;&#x663E;&#x793A;&#x7684;&#x52A8;&#x4F5C;&#x5C31;&#x4F1A;&#x8D8A;&#x6D41;&#x7545;&#x3002;&#x5E27;&#x7387;&#x4E5F;&#x4F1A;&#x5F71;&#x54CD;&#x4F53;&#x79EF;&#xFF0C;&#x5E27;&#x7387;&#x8D8A;&#x9AD8;&#xFF0C;&#x6BCF;&#x79D2;&#x949F;&#x663E;&#x793A;&#x7684;&#x753B;&#x9762;&#x8D8A;&#x591A;&#xFF0C;&#x4F53;&#x79EF;&#x5C31;&#x8D8A;&#x5927;&#x3002;<br>       &#x7531;&#x4E8E;&#x4EBA;&#x7C7B;&#x773C;&#x775B;&#x7684;&#x7279;&#x6B8A;&#x751F;&#x7406;&#x7ED3;&#x6784;&#xFF0C;&#x5982;&#x679C;&#x753B;&#x9762;&#x5E27;&#x7387;&#x9AD8;&#x4E8E;16&#xFF0C;&#x5C31;&#x4F1A;&#x8BA4;&#x4E3A;&#x662F;&#x8FDE;&#x8D2F;&#x7684;&#xFF0C;&#x6B64;&#x73B0;&#x8C61;&#x79F0;&#x4E4B;&#x4E3A;&#x89C6;&#x89C9;&#x6682;&#x7559;&#x3002;&#x5E76;&#x4E14;&#x5F53;&#x5E27;&#x901F;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x6570;&#x503C;&#x540E;&#xFF0C;&#x518D;&#x589E;&#x957F;&#x7684;&#x8BDD;&#xFF0C;&#x4EBA;&#x773C;&#x80FD;&#x611F;&#x77E5;&#x7684;&#x6D41;&#x7545;&#x5EA6;&#x7684;&#x63D0;&#x5347;&#x5C31;&#x6BD4;&#x8F83;&#x6709;&#x9650;&#x4E86;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;30fps&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x5C06;&#x6027;&#x80FD;&#x63D0;&#x5347;&#x81F3;60fps&#x5219;&#x53EF;&#x4EE5;&#x660E;&#x663E;&#x63D0;&#x5347;&#x4EA4;&#x4E92;&#x611F;&#x548C;&#x903C;&#x771F;&#x611F;&#xFF0C;&#x5982;&#x679C;&#x8D85;&#x8FC7;75fps&#x4E00;&#x822C;&#x5C31;&#x4E0D;&#x5BB9;&#x6613;&#x5BDF;&#x89C9;&#x5230;&#x6709;&#x660E;&#x663E;&#x7684;&#x6D41;&#x7545;&#x5EA6;&#x63D0;&#x5347;&#x4E86;&#x3002;&#x5982;&#x679C;&#x5E27;&#x7387;&#x8D85;&#x8FC7;&#x5C4F;&#x5E55;&#x5237;&#x65B0;&#x7387;&#x53EA;&#x4F1A;&#x6D6A;&#x8D39;&#x56FE;&#x5F62;&#x5904;&#x7406;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x76D1;&#x89C6;&#x5668;&#x4E0D;&#x80FD;&#x4EE5;&#x8FD9;&#x4E48;&#x5FEB;&#x7684;&#x901F;&#x5EA6;&#x66F4;&#x65B0;&#x3002;</p>
<p>&#x5206;&#x8FA8;&#x7387;<br>       &#x901A;&#x5E38;&#x6240;&#x8BF4;&#x7684;1280x720&#xFF08;720p&#xFF09;&#x6216;&#x8005;1920x1080&#xFF08;1080p&#xFF09;&#xFF0C;&#x5C31;&#x662F;&#x89C6;&#x9891;&#x7684;&#x5206;&#x8FA8;&#x7387;&#x3002;&#x5206;&#x8FA8;&#x7387;&#x5F71;&#x54CD;&#x56FE;&#x50CF;&#x5927;&#x5C0F;&#xFF0C;&#x4E0E;&#x56FE;&#x50CF;&#x5927;&#x5C0F;&#x6210;&#x6B63;&#x6BD4;&#xFF1A;&#x5206;&#x8FA8;&#x7387;&#x8D8A;&#x9AD8;&#xFF0C;&#x56FE;&#x50CF;&#x8D8A;&#x5927;&#xFF1B;&#x5206;&#x8FA8;&#x7387;&#x8D8A;&#x4F4E;&#xFF0C;&#x56FE;&#x50CF;&#x8D8A;&#x5C0F;&#x3002;</p>
<p>&#x6E05;&#x6670;&#x5EA6;<br>       &#x5728;&#x7801;&#x7387;&#x4E00;&#x5B9A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5206;&#x8FA8;&#x7387;&#x4E0E;&#x6E05;&#x6670;&#x5EA6;&#x6210;&#x53CD;&#x6BD4;&#x5173;&#x7CFB;&#xFF1A;&#x5206;&#x8FA8;&#x7387;&#x8D8A;&#x9AD8;&#xFF0C;&#x56FE;&#x50CF;&#x8D8A;&#x4E0D;&#x6E05;&#x6670;&#xFF0C;&#x5206;&#x8FA8;&#x7387;&#x8D8A;&#x4F4E;&#xFF0C;&#x56FE;&#x50CF;&#x8D8A;&#x6E05;&#x6670;&#x3002;<br>       &#x5728;&#x5206;&#x8FA8;&#x7387;&#x4E00;&#x5B9A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7801;&#x7387;&#x4E0E;&#x6E05;&#x6670;&#x5EA6;&#x6210;&#x6B63;&#x6BD4;&#x5173;&#x7CFB;&#xFF0C;&#x7801;&#x7387;&#x8D8A;&#x9AD8;&#xFF0C;&#x56FE;&#x50CF;&#x8D8A;&#x6E05;&#x6670;&#xFF1B;&#x7801;&#x7387;&#x8D8A;&#x4F4E;&#xFF0C;&#x56FE;&#x50CF;&#x8D8A;&#x4E0D;&#x6E05;&#x6670;&#x3002;</p>
<p>&#x58F0;&#x9053;<br>       &#x6307;&#x58F0;&#x97F3;&#x5728;&#x5F55;&#x5236;&#x6216;&#x64AD;&#x653E;&#x65F6;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7A7A;&#x95F4;&#x4F4D;&#x7F6E;&#x91C7;&#x96C6;&#x6216;&#x56DE;&#x653E;&#x7684;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#x97F3;&#x9891;&#x4FE1;&#x53F7;&#xFF0C;&#x6240;&#x4EE5;&#x58F0;&#x9053;&#x6570;&#x4E5F;&#x5C31;&#x662F;&#x58F0;&#x97F3;&#x5F55;&#x5236;&#x65F6;&#x7684;&#x97F3;&#x6E90;&#x6570;&#x91CF;&#x6216;&#x56DE;&#x653E;&#x65F6;&#x76F8;&#x5E94;&#x7684;&#x626C;&#x58F0;&#x5668;&#x6570;&#x91CF;&#x3002; </p>
<p>&#x4F4D;&#x6DF1;&#x5EA6;<br>       &#x6BCF;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x7528;&#x591A;&#x5C11;&#x4F4D;&#x8868;&#x793A;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F4D;&#x6570;&#x5C31;&#x53EB;&#x201C;&#x4F4D;&#x6DF1;&#x5EA6;&#x201D;&#x3002;&#x4F4D;&#x6DF1;&#x5EA6;&#x8D8A;&#x5927;&#xFF0C;&#x53EF;&#x7528;&#x7684;&#x989C;&#x8272;&#x8D8A;&#x591A;&#xFF0C;&#x989C;&#x8272;&#x8868;&#x73B0;&#x5C31;&#x8D8A;&#x903C;&#x771F;&#x3002;&#x4F4D;&#x6DF1;&#x5EA6;&#x4E3A;8&#x7684;&#x56FE;&#x50CF;&#x53EF;&#x7528;&#x989C;&#x8272;&#x4E3A;256&#x79CD;&#x3002;</p>
<pre><code>&#x6BCF;&#x4E2A;&#x89C6;&#x9891;&#x90FD;&#x5305;&#x542B;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x53EB;&#x505A;MediaInfo&#x7684;&#x5DE5;&#x5177;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x6765;&#x67E5;&#x770B;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x7684;&#x8BE6;&#x7EC6;&#x53C2;&#x6570;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4E24;&#x5F20;&#x56FE;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x7684;&#x53C2;&#x6570;&#x4FE1;&#x606F;&#x3002;


&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x56FE;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x89C6;&#x9891;&#x7684;&#x5E27;&#x7387;&#x4E3A;20fps&#xFF0C;&#x89C6;&#x9891;&#x5E73;&#x5747;&#x7801;&#x7387;&#x4E3A;195kbps&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x91C7;&#x7528;&#x7684;VBR&#x7F16;&#x7801;&#xFF0C;&#x800C;&#x97F3;&#x9891;&#x548C;&#x89C6;&#x9891;&#x5206;&#x522B;&#x7684;&#x7801;&#x7387;&#x4E3A;64kbps&#x548C;128kbps&#xFF0C;&#x89C6;&#x9891;&#x8F68;&#x548C;&#x97F3;&#x9891;&#x8F68;&#x7684;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x5206;&#x522B;&#x4E3A;H.264 AVC&#x548C;AAC&#x3002;
</code></pre><p>&#x89C6;&#x9891;&#x7684;&#x683C;&#x5F0F;<br>       &#x8BF4;&#x5230;&#x89C6;&#x9891;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x9996;&#x5148;&#x60F3;&#x5230;&#x7684;&#x53EF;&#x80FD;&#x4F1A;&#x662F;mp4&#x3001;3gp&#x3001;avi&#x3001;flv&#x3001;rmvb&#x3001;mkv&#x7B49;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x5E38;&#x89C1;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x3002;&#x8FD9;&#x4E9B;&#x683C;&#x5F0F;&#x5176;&#x5B9E;&#x53EA;&#x662F;&#x89C6;&#x9891;&#x7684;&#x5C01;&#x88C5;&#x683C;&#x5F0F;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x89C6;&#x9891;&#x7684;&#x683C;&#x5F0F;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#xFF1A;&#x5C01;&#x88C5;&#x683C;&#x5F0F;&#x548C;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x3002;<br>       &#x4E00;&#x5F20;&#x56FE;&#x7247;&#x53EF;&#x4EE5;&#x7528;&#x5F88;&#x591A;&#x79CD;&#x7B97;&#x6CD5;&#x6765;&#x663E;&#x793A;&#x5728;&#x5C4F;&#x5E55;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x56FE;&#x7247;&#x7684;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x5C31;&#x6709;&#x4E86;JPEG&#xFF0C;BMP&#xFF0C;PNG&#x7B49;&#x3002;&#x3002;&#x3002; &#x89C6;&#x9891;&#x662F;&#x52A8;&#x6001;&#x56FE;&#x50CF;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x5C31;&#x53C8;&#x591A;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x7528;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x8868;&#x8FBE;1s&#x5185;&#x7684;&#x82E5;&#x5E72;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7B80;&#x5355;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x89C6;&#x9891;&#x7F16;&#x7801;&#xFF0C;&#x7EE7;&#x800C;&#x5C31;&#x8BDE;&#x751F;&#x4E86;MPEG&#xFF0C;H.264&#x7B49;&#x591A;&#x79CD;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x3002;&#x540E;&#x6765;&#x6709;&#x4E86;&#x97F3;&#x9891;&#x3001;&#x5B57;&#x5E55;&#x3001;&#x914D;&#x97F3;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x6765;&#x628A;&#x4ED6;&#x4EEC;&#x5168;&#x90E8;&#x653E;&#x8FDB;&#x53BB;&#x4FDD;&#x5B58;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x8BDE;&#x751F;&#x4E86;&#x5C01;&#x88C5;&#x683C;&#x5F0F;&#x3002;&#x8FD9;&#x6BB5;&#x8BDD;&#x5C31;&#x901A;&#x4FD7;&#x7684;&#x89E3;&#x91CA;&#x4E86;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x548C;&#x5C01;&#x88C5;&#x683C;&#x5F0F;&#x7684;&#x4F5C;&#x7528;&#x548C;&#x533A;&#x522B;&#x3002;</p>
<p>&#x5C01;&#x88C5;&#x683C;&#x5F0F;<br>       &#x6240;&#x8C13;&#x5C01;&#x88C5;&#x683C;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x89C4;&#x5219;&#x6765;&#x5C06;&#x89C6;&#x9891;&#x8F68;&#x9053;&#x3001;&#x53EF;&#x80FD;&#x591A;&#x4E2A;&#x7684;&#x97F3;&#x9891;&#x8F68;&#x9053;&#x3001;&#x5B57;&#x5E55;&#x7B49;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x6240;&#x9700;&#x8981;&#x7684;&#x96F6;&#x6563;&#x4FE1;&#x606F;&#x7EC4;&#x88C5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x64AD;&#x653E;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x8D77;&#x540C;&#x6B65;&#x8FDB;&#x884C;&#x64AD;&#x653E;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x4E86;&#x89C6;&#x9891;&#x7D22;&#x5F15;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5728;&#x64AD;&#x653E;&#x89C6;&#x9891;&#x65F6;&#x62D6;&#x52A8;&#x8FDB;&#x5EA6;&#x6761;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x5916;&#x58F3;&#xFF0C;&#x6216;&#x8005;&#x628A;&#x5B83;&#x5F53;&#x6210;&#x4E00;&#x4E2A;&#x653E;&#x89C6;&#x9891;&#x8F68;&#x548C;&#x97F3;&#x9891;&#x8F68;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x4E5F;&#x53EF;&#x4EE5;&#x3002;&#x540C;&#x65F6;&#x91CC;&#x9762;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x5F53;&#x524D;&#x6D41;&#x4E2D;&#x5305;&#x542B;&#x54EA;&#x4E9B;&#x7F16;&#x7801;&#x7C7B;&#x578B;&#x3001;&#x65F6;&#x95F4;&#x6233;&#x7B49;&#xFF0C;&#x64AD;&#x653E;&#x5668;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x6765;&#x5339;&#x914D;&#x89E3;&#x7801;&#x5668;&#x3001;&#x540C;&#x6B65;&#x97F3;&#x89C6;&#x9891;&#x3002;&#x4F46;&#x662F;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x7684;&#x5C01;&#x88C5;&#x683C;&#x5F0F;&#x5E76;&#x4E0D;&#x5F71;&#x54CD;&#x89C6;&#x9891;&#x7684;&#x753B;&#x8D28;&#xFF0C;&#x5F71;&#x54CD;&#x89C6;&#x9891;&#x753B;&#x8D28;&#x7684;&#x662F;&#x89C6;&#x9891;&#x7684;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x3002;<br>       &#x89C6;&#x9891;&#x5C01;&#x88C5;&#x683C;&#x5F0F;&#x5176;&#x5B9E;&#x548C;&#x91CC;&#x9762;&#x7684;&#x89C6;&#x9891;&#x7F16;&#x7801;&#x548C;&#x97F3;&#x9891;&#x7F16;&#x7801;&#x5173;&#x7CFB;&#x4E0D;&#x5927;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5C01;&#x88C5;&#x683C;&#x5F0F;&#x662F;&#x4E3A;&#x4E86;&#x9002;&#x5E94;&#x4E0D;&#x540C;&#x7684;&#x64AD;&#x653E;&#x573A;&#x666F;&#x3002;&#x5178;&#x578B;&#x7684;&#x4E09;&#x79CD;&#x89C6;&#x9891;&#x5C01;&#x88C5;&#xFF1A;ts&#x3001;mp4&#x548C;mkv&#xFF0C;ts&#x9002;&#x5408;&#x7F51;&#x7EDC;&#x6D41;&#x5A92;&#x4F53;&#x64AD;&#x653E;&#xFF0C;&#x4F53;&#x79EF;&#x8F83;&#x5927;&#xFF0C;&#x4E00;&#x822C;&#x7528;&#x4E8E;&#x7535;&#x89C6;&#x76F4;&#x64AD;&#x6216;&#x7F51;&#x7EDC;&#x76F4;&#x64AD;&#x4E2D;&#xFF1B;mp4&#x4E00;&#x822C;&#x53EA;&#x5305;&#x62EC;&#x4E00;&#x6761;&#x89C6;&#x9891;&#x8F68;&#x548C;&#x4E00;&#x6761;&#x97F3;&#x9891;&#x8F68;&#xFF0C;&#x9002;&#x5408;&#x5927;&#x591A;&#x6570;&#x8BBE;&#x5907;&#xFF0C;&#x517C;&#x5BB9;&#x6027;&#x6700;&#x597D;&#xFF1B;mkv&#x53EF;&#x4EE5;&#x5C01;&#x88C5;&#x591A;&#x4E2A;&#x97F3;&#x9891;&#x8F68;&#x3001;&#x5B57;&#x5E55;&#x8F68;&#xFF0C;&#x9002;&#x5408;&#x7F51;&#x7EDC;&#x4F20;&#x64AD;&#x5206;&#x4EAB;&#x3002;<br>       &#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x540E;&#x7F00;&#x540D;&#x5C31;&#x662F;&#x5C01;&#x88C5;&#x683C;&#x5F0F;&#x7684;&#x540D;&#x5B57;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x4FEE;&#x6539;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x7684;&#x540E;&#x7F00;&#x3002;</p>
<p>&#x7F16;&#x7801;&#x683C;&#x5F0F;<br>       &#x6240;&#x8C13;&#x89C6;&#x9891;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x5C31;&#x662F;&#x6307;&#x901A;&#x8FC7;&#x7279;&#x5B9A;&#x7684;&#x538B;&#x7F29;&#x6280;&#x672F;&#xFF0C;&#x5C06;&#x67D0;&#x4E2A;&#x89C6;&#x9891;&#x683C;&#x5F0F;&#x7684;&#x6587;&#x4EF6;&#x8F6C;&#x6362;&#x6210;&#x53E6;&#x4E00;&#x79CD;&#x89C6;&#x9891;&#x683C;&#x5F0F;&#x6587;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x4E0D;&#x540C;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x7684;&#x533A;&#x522B;&#x4E3B;&#x8981;&#x662F;&#x538B;&#x7F29;&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x540C;&#x3002;&#x89C6;&#x9891;&#x7F16;&#x7801;&#x7684;&#x76EE;&#x7684;&#x4E3B;&#x8981;&#x662F;&#x538B;&#x7F29;&#x6570;&#x636E;&#x4F53;&#x79EF;&#x3002;&#x89C6;&#x9891;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x7F16;&#x7801;&#x6807;&#x51C6;&#x6709;H.26X&#x7CFB;&#x5217;&#x3001;MPEG&#x7CFB;&#x5217;&#x3001;Divx&#x3001;Xvid&#x3001;WMV-HD&#x548C;VC-1&#x7B49;&#x7B49;&#x3002;<br>       &#x5728;&#x79FB;&#x52A8;&#x7AEF;&#x4F7F;&#x7528;&#x6700;&#x591A;&#x7684;mp4&#x89C6;&#x9891;&#x6587;&#x4EF6;&#xFF0C;&#x4E3B;&#x8981;&#x4F7F;&#x7528;H.264 AVC&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x3002;&#x5B83;&#x4E3B;&#x8981;&#x6709;&#x4EE5;&#x4E0B;&#x4F18;&#x70B9;&#xFF1A;<br>       1&#xFF0E;&#x4F4E;&#x7801;&#x7387;&#xFF1A;&#x548C;MPEG2&#x3001;MPEG4&#x7B49;&#x538B;&#x7F29;&#x6280;&#x672F;&#x76F8;&#x6BD4;&#xFF0C;&#x5728;&#x540C;&#x7B49;&#x56FE;&#x50CF;&#x8D28;&#x91CF;&#x4E0B;&#xFF0C;&#x91C7;&#x7528;H.264&#x6280;&#x672F;&#x538B;&#x7F29;&#x540E;&#x7684;&#x6570;&#x636E;&#x91CF;&#x53EA;&#x6709;MPEG2&#x7684;1/8&#xFF0C;MPEG4&#x7684;1/3&#x3002;H.264&#x7684;&#x6700;&#x5927;&#x4F18;&#x52BF;&#x662F;&#x5177;&#x6709;&#x5F88;&#x9AD8;&#x7684;&#x6570;&#x636E;&#x538B;&#x7F29;&#x7387;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x51CF;&#x5C11;&#x7528;&#x6237;&#x5E26;&#x5BBD;&#x7684;&#x5360;&#x7528;&#x3002;<br>       2&#xFF0E;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x56FE;&#x50CF;&#xFF1A;H.264&#x80FD;&#x63D0;&#x4F9B;&#x8FDE;&#x7EED;&#x3001;&#x6D41;&#x7545;&#x7684;&#x9AD8;&#x8D28;&#x91CF;&#x56FE;&#x50CF;&#x3002;<br>       3&#xFF0E;&#x5BB9;&#x9519;&#x80FD;&#x529B;&#x5F3A;&#xFF1A;H.264&#x63D0;&#x4F9B;&#x4E86;&#x89E3;&#x51B3;&#x5728;&#x4E0D;&#x7A33;&#x5B9A;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x4E0B;&#x5BB9;&#x6613;&#x53D1;&#x751F;&#x7684;&#x4E22;&#x5305;&#x7B49;&#x9519;&#x8BEF;&#x7684;&#x5FC5;&#x8981;&#x5DE5;&#x5177;&#x3002;<br>       4&#xFF0E;&#x7F51;&#x7EDC;&#x9002;&#x5E94;&#x6027;&#x5F3A;&#xFF1A;H.264&#x63D0;&#x4F9B;&#x4E86;&#x7F51;&#x7EDC;&#x62BD;&#x8C61;&#x5C42;&#xFF0C;&#x4F7F;&#x5F97;H.264&#x7684;&#x6587;&#x4EF6;&#x80FD;&#x5BB9;&#x6613;&#x5730;&#x5728;&#x4E0D;&#x540C;&#x7F51;&#x7EDC;&#x4E0A;&#x4F20;&#x8F93;&#x3002;<br>       &#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x662F;&#x7531;&#x97F3;&#x9891;&#x548C;&#x89C6;&#x9891;&#x4E24;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#x3002;H.264&#x3001;Xvid&#x7B49;&#x5C31;&#x662F;&#x89C6;&#x9891;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#xFF0C;MP3&#x3001;AAC&#x7B49;&#x5C31;&#x662F;&#x97F3;&#x9891;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x3002;&#x800C;&#x5F53;&#x524D;&#x5BA2;&#x6237;&#x7AEF;&#x4E2D;&#x4F7F;&#x7528;&#x6700;&#x591A;&#x7684;mp4&#x683C;&#x5F0F;&#x7684;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#xFF0C;&#x89C6;&#x9891;&#x548C;&#x97F3;&#x9891;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x662F;H.264&#x548C;AAC&#x7F16;&#x7801;&#x3002;<br>       &#x4E0B;&#x56FE;&#x5217;&#x51FA;&#x6765;&#x5E38;&#x7528;&#x7684;&#x89C6;&#x9891;&#x5C01;&#x88C5;&#x683C;&#x5F0F;&#x4E0E;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;</p>
<pre><code>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5F88;&#x591A;&#x5C01;&#x88C5;&#x5BB9;&#x5668;&#x5BF9;&#x97F3;&#x9891;&#x7F16;&#x7801;&#x548C;&#x89C6;&#x9891;&#x7F16;&#x7801;&#x7684;&#x7EC4;&#x5408;&#x65B9;&#x5F0F;&#x653E;&#x7684;&#x5F88;&#x5F00;&#xFF0C;&#x5982;AVI&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;H264+AAC&#x7EC4;&#x5408;&#x3002;&#x5C24;
</code></pre><p>&#x5176;&#x662F;MKV&#x5C01;&#x88C5;&#x5BB9;&#x5668;&#xFF0C;&#x57FA;&#x672C;&#x65E0;&#x8BBA;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x7EC4;&#x5408;&#x90FD;&#x53EF;&#x4EE5;&#xFF01;&#x4F46;&#x4E00;&#x822C;MKV&#x7528;&#x7684;&#x6700;&#x591A;&#x7684;&#x5C31;&#x662F;H264+AAC&#x7EC4;&#x5408;&#xFF0C;&#x6B64;&#x7EC4;&#x5408;&#x6587;&#x4EF6;<br>&#x4F53;&#x79EF;&#x6700;&#x5C0F;&#xFF0C;&#x6E05;&#x6670;&#x5EA6;&#x6700;&#x9AD8;&#x3002;</p>
<p>H.264&#x7F16;&#x7801;<br>&#x57FA;&#x672C;&#x539F;&#x7406;<br>       H.264&#x662F;&#x65B0;&#x4E00;&#x4EE3;&#x7684;&#x7F16;&#x7801;&#x6807;&#x51C6;&#xFF0C;&#x4EE5;&#x9AD8;&#x538B;&#x7F29;&#x9AD8;&#x8D28;&#x91CF;&#x548C;&#x652F;&#x6301;&#x591A;&#x79CD;&#x7F51;&#x7EDC;&#x7684;&#x6D41;&#x5A92;&#x4F53;&#x4F20;&#x8F93;&#x8457;&#x79F0;&#xFF0C;&#x5728;&#x7F16;&#x7801;&#x65B9;&#x9762;&#xFF0C;&#x5B83;&#x7684;&#x7406;&#x8BBA;&#x4F9D;&#x636E;&#x662F;&#xFF1A;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x56FE;&#x50CF;&#x7684;&#x7EDF;&#x8BA1;&#x7ED3;&#x679C;&#x8868;&#x660E;&#xFF0C;&#x5728;&#x76F8;&#x90BB;&#x51E0;&#x5E45;&#x56FE;&#x50CF;&#x753B;&#x9762;&#x4E2D;&#xFF0C;&#x4E00;&#x822C;&#x6709;&#x5DEE;&#x522B;&#x7684;&#x50CF;&#x7D20;&#x53EA;&#x6709;10%&#x4EE5;&#x5185;&#x7684;&#x70B9;&#xFF0C;&#x4EAE;&#x5EA6;&#x5DEE;&#x503C;&#x53D8;&#x5316;&#x4E0D;&#x8D85;&#x8FC7;2%&#xFF0C;&#x800C;&#x8272;&#x5EA6;&#x5DEE;&#x503C;&#x7684;&#x53D8;&#x5316;&#x53EA;&#x6709;1%&#x4EE5;&#x5185;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x4E00;&#x6BB5;&#x53D8;&#x5316;&#x4E0D;&#x5927;&#x7684;&#x56FE;&#x50CF;&#x753B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5148;&#x7F16;&#x7801;&#x51FA;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x56FE;&#x50CF;&#x5E27;A&#xFF0C;&#x968F;&#x540E;&#x7684;B&#x5E27;&#x4E0D;&#x7F16;&#x7801;&#x5168;&#x90E8;&#x56FE;&#x50CF;&#xFF0C;&#x53EA;&#x5199;&#x5165;&#x4E0E;A&#x5E27;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x8FD9;&#x6837;B&#x5E27;&#x7684;&#x5927;&#x5C0F;&#x5C31;&#x53EA;&#x6709;&#x5B8C;&#x6574;&#x5E27;&#x7684;1/10&#x6216;&#x66F4;&#x5C0F;&#xFF01;B&#x5E27;&#x4E4B;&#x540E;&#x7684;C&#x5E27;&#x5982;&#x679C;&#x53D8;&#x5316;&#x4E0D;&#x5927;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x4EE5;&#x53C2;&#x8003;B&#x7684;&#x65B9;&#x5F0F;&#x7F16;&#x7801;C&#x5E27;&#xFF0C;&#x8FD9;&#x6837;&#x5FAA;&#x73AF;&#x4E0B;&#x53BB;&#x3002;&#x8FD9;&#x6BB5;&#x56FE;&#x50CF;&#x6211;&#x4EEC;&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#xFF0C;&#x5F53;&#x67D0;&#x4E2A;&#x56FE;&#x50CF;&#x4E0E;&#x4E4B;&#x524D;&#x7684;&#x56FE;&#x50CF;&#x53D8;&#x5316;&#x5F88;&#x5927;&#xFF0C;&#x65E0;&#x6CD5;&#x53C2;&#x8003;&#x524D;&#x9762;&#x7684;&#x5E27;&#x6765;&#x751F;&#x6210;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x5C31;&#x7ED3;&#x675F;&#x4E0A;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#xFF0C;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x6BB5;&#x5E8F;&#x5217;&#x3002;<br>&#x3000;&#x3000;&#x5728;H264&#x534F;&#x8BAE;&#x91CC;&#x5B9A;&#x4E49;&#x4E86;&#x4E09;&#x79CD;&#x5E27;&#xFF0C;&#x5B8C;&#x6574;&#x7F16;&#x7801;&#x7684;&#x5E27;&#x53EB;I&#x5E27;&#xFF0C;&#x53C2;&#x8003;&#x4E4B;&#x524D;&#x7684;I&#x5E27;&#x751F;&#x6210;&#x7684;&#x53EA;&#x5305;&#x542B;&#x5DEE;&#x5F02;&#x90E8;&#x5206;&#x7F16;&#x7801;&#x7684;&#x5E27;&#x53EB;P&#x5E27;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x53C2;&#x8003;&#x524D;&#x540E;&#x7684;&#x5E27;&#x7F16;&#x7801;&#x7684;&#x5E27;&#x53EB;B&#x5E27;&#x3002;<br>&#x3000;&#x3000;H264&#x91C7;&#x7528;&#x7684;&#x6838;&#x5FC3;&#x7B97;&#x6CD5;&#x662F;&#x5E27;&#x5185;&#x538B;&#x7F29;&#x548C;&#x5E27;&#x95F4;&#x538B;&#x7F29;&#xFF0C;&#x5E27;&#x5185;&#x538B;&#x7F29;&#x662F;&#x751F;&#x6210;I&#x5E27;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x5E27;&#x95F4;&#x538B;&#x7F29;&#x662F;&#x751F;&#x6210;B&#x5E27;&#x548C;P&#x5E27;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x5E8F;&#x5217;<br>&#x3000;&#x3000;&#x5728;H264&#x4E2D;&#xFF0C;&#x56FE;&#x50CF;&#x4EE5;&#x5E8F;&#x5217;&#x4E3A;&#x5355;&#x4F4D;&#x8FDB;&#x884C;&#x7EC4;&#x7EC7;&#xFF0C;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x662F;&#x4E00;&#x6BB5;&#x56FE;&#x50CF;&#x7F16;&#x7801;&#x540E;&#x7684;&#x6570;&#x636E;&#x6D41;&#xFF0C;&#x4EE5;I&#x5E27;&#x5F00;&#x59CB;&#xFF0C;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;I&#x5E27;&#x7ED3;&#x675F;&#x3002;<br>&#x3000;&#x3000;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x56FE;&#x50CF;&#x53EB;&#x505A; IDR &#x56FE;&#x50CF;&#xFF08;&#x7ACB;&#x5373;&#x5237;&#x65B0;&#x56FE;&#x50CF;&#xFF09;&#xFF0C;IDR &#x56FE;&#x50CF;&#x90FD;&#x662F; I &#x5E27;&#x56FE;&#x50CF;&#x3002;H.264 &#x5F15;&#x5165; IDR &#x56FE;&#x50CF;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x7801;&#x7684;&#x91CD;&#x540C;&#x6B65;&#xFF0C;&#x5F53;&#x89E3;&#x7801;&#x5668;&#x89E3;&#x7801;&#x5230; IDR &#x56FE;&#x50CF;&#x65F6;&#xFF0C;&#x7ACB;&#x5373;&#x5C06;&#x53C2;&#x8003;&#x5E27;&#x961F;&#x5217;&#x6E05;&#x7A7A;&#xFF0C;&#x5C06;&#x5DF2;&#x89E3;&#x7801;&#x7684;&#x6570;&#x636E;&#x5168;&#x90E8;&#x8F93;&#x51FA;&#x6216;&#x629B;&#x5F03;&#xFF0C;&#x91CD;&#x65B0;&#x67E5;&#x627E;&#x53C2;&#x6570;&#x96C6;&#xFF0C;&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5E8F;&#x5217;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x524D;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x51FA;&#x73B0;&#x91CD;&#x5927;&#x9519;&#x8BEF;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x91CD;&#x65B0;&#x540C;&#x6B65;&#x7684;&#x673A;&#x4F1A;&#x3002;IDR&#x56FE;&#x50CF;&#x4E4B;&#x540E;&#x7684;&#x56FE;&#x50CF;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;IDR&#x4E4B;&#x524D;&#x7684;&#x56FE;&#x50CF;&#x7684;&#x6570;&#x636E;&#x6765;&#x89E3;&#x7801;&#x3002;<br>&#x3000;&#x3000;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x5C31;&#x662F;&#x4E00;&#x6BB5;&#x5185;&#x5BB9;&#x5DEE;&#x5F02;&#x4E0D;&#x592A;&#x5927;&#x7684;&#x56FE;&#x50CF;&#x7F16;&#x7801;&#x540E;&#x751F;&#x6210;&#x7684;&#x4E00;&#x4E32;&#x6570;&#x636E;&#x6D41;&#x3002;&#x5F53;&#x8FD0;&#x52A8;&#x53D8;&#x5316;&#x6BD4;&#x8F83;&#x5C11;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x53EF;&#x4EE5;&#x5F88;&#x957F;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD0;&#x52A8;&#x53D8;&#x5316;&#x5C11;&#x5C31;&#x4EE3;&#x8868;&#x56FE;&#x50CF;&#x753B;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x53D8;&#x52A8;&#x5F88;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x53EF;&#x4EE5;&#x7F16;&#x4E00;&#x4E2A;I&#x5E27;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x76F4;P&#x5E27;&#x3001;B&#x5E27;&#x4E86;&#x3002;&#x5F53;&#x8FD0;&#x52A8;&#x53D8;&#x5316;&#x591A;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x5C31;&#x6BD4;&#x8F83;&#x77ED;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x5C31;&#x5305;&#x542B;&#x4E00;&#x4E2A;I&#x5E27;&#x548C;3&#x3001;4&#x4E2A;P&#x5E27;&#x3002;</p>
<p>&#x4E09;&#x79CD;&#x5E27;&#x7684;&#x4E0D;&#x540C;<br>I&#x5E27;<br>&#x5E27;&#x5185;&#x7F16;&#x7801;&#x5E27;&#xFF0C;I&#x5E27;&#x8868;&#x793A;&#x5173;&#x952E;&#x5E27;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x8FD9;&#x4E00;&#x5E27;&#x753B;&#x9762;&#x7684;&#x5B8C;&#x6574;&#x4FDD;&#x7559;&#xFF0C;&#x89E3;&#x7801;&#x65F6;&#x53EA;&#x9700;&#x8981;&#x672C;&#x5E27;&#x6570;&#x636E;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x3002;<br>1)&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5168;&#x5E27;&#x538B;&#x7F29;&#x7F16;&#x7801;&#x5E27;&#x3002;&#x5B83;&#x5C06;&#x5168;&#x5E27;&#x56FE;&#x50CF;&#x4FE1;&#x606F;&#x8FDB;&#x884C;JPEG&#x538B;&#x7F29;&#x7F16;&#x7801;&#x53CA;&#x4F20;&#x8F93;;<br>2)&#x89E3;&#x7801;&#x65F6;&#x4EC5;&#x7528;I&#x5E27;&#x7684;&#x6570;&#x636E;&#x5C31;&#x53EF;&#x91CD;&#x6784;&#x5B8C;&#x6574;&#x56FE;&#x50CF;;<br>3)I&#x5E27;&#x63CF;&#x8FF0;&#x4E86;&#x56FE;&#x50CF;&#x80CC;&#x666F;&#x548C;&#x8FD0;&#x52A8;&#x4E3B;&#x4F53;&#x7684;&#x8BE6;&#x60C5;;<br>4)I&#x5E27;&#x4E0D;&#x9700;&#x8981;&#x53C2;&#x8003;&#x5176;&#x4ED6;&#x753B;&#x9762;&#x800C;&#x751F;&#x6210;;<br>5)I&#x5E27;&#x662F;P&#x5E27;&#x548C;B&#x5E27;&#x7684;&#x53C2;&#x8003;&#x5E27;(&#x5176;&#x8D28;&#x91CF;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x5230;&#x540C;&#x7EC4;&#x4E2D;&#x4EE5;&#x540E;&#x5404;&#x5E27;&#x7684;&#x8D28;&#x91CF;);<br>6)I&#x5E27;&#x662F;&#x5E27;&#x7EC4;GOP&#x7684;&#x57FA;&#x7840;&#x5E27;(&#x7B2C;&#x4E00;&#x5E27;)&#xFF0C;&#x5728;&#x4E00;&#x7EC4;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;I&#x5E27;;<br>7)I&#x5E27;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x8FD0;&#x52A8;&#x77E2;&#x91CF;;<br>8)I&#x5E27;&#x6240;&#x5360;&#x6570;&#x636E;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x6BD4;&#x8F83;&#x5927;&#x3002;<br>P&#x5E27;<br>&#x524D;&#x5411;&#x9884;&#x6D4B;&#x7F16;&#x7801;&#x5E27;&#x3002;P&#x5E27;&#x8868;&#x793A;&#x7684;&#x662F;&#x8FD9;&#x4E00;&#x5E27;&#x8DDF;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5E27;&#xFF08;&#x6216;P&#x5E27;&#xFF09;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x89E3;&#x7801;&#x65F6;&#x9700;&#x8981;&#x7528;&#x4E4B;&#x524D;&#x7F13;&#x5B58;&#x7684;&#x753B;&#x9762;&#x53E0;&#x52A0;&#x4E0A;&#x672C;&#x5E27;&#x5B9A;&#x4E49;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x751F;&#x6210;&#x6700;&#x7EC8;&#x753B;&#x9762;&#x3002;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x5DEE;&#x522B;&#x5E27;&#xFF0C;P&#x5E27;&#x6CA1;&#x6709;&#x5B8C;&#x6574;&#x753B;&#x9762;&#x6570;&#x636E;&#xFF0C;&#x53EA;&#x6709;&#x4E0E;&#x524D;&#x4E00;&#x5E27;&#x7684;&#x753B;&#x9762;&#x5DEE;&#x522B;&#x7684;&#x6570;&#x636E;&#xFF09;&#x3002;<br>P&#x5E27;&#x7684;&#x9884;&#x6D4B;&#x4E0E;&#x91CD;&#x6784;&#xFF1A;P&#x5E27;&#x662F;&#x4EE5;I&#x5E27;&#x4E3A;&#x53C2;&#x8003;&#x5E27;&#xFF0C;&#x5728;I&#x5E27;&#x4E2D;&#x627E;&#x51FA;P&#x5E27;&#x201C;&#x67D0;&#x70B9;&#x201D;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x548C;&#x8FD0;&#x52A8;&#x77E2;&#x91CF;&#xFF0C;&#x53D6;&#x9884;&#x6D4B;&#x5DEE;&#x503C;&#x548C;&#x8FD0;&#x52A8;&#x77E2;&#x91CF;&#x4E00;&#x8D77;&#x4F20;&#x9001;&#x3002;&#x5728;&#x63A5;&#x6536;&#x7AEF;&#x6839;&#x636E;&#x8FD0;&#x52A8;&#x77E2;&#x91CF;&#x4ECE;I&#x5E27;&#x4E2D;&#x627E;&#x51FA;P&#x5E27;&#x201C;&#x67D0;&#x70B9;&#x201D;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x5E76;&#x4E0E;&#x5DEE;&#x503C;&#x76F8;&#x52A0;&#x4EE5;&#x5F97;&#x5230;P&#x5E27;&#x201C;&#x67D0;&#x70B9;&#x201D;&#x6837;&#x503C;&#x4ECE;&#x800C;&#x53EF;&#x5F97;&#x5230;&#x5B8C;&#x6574;&#x7684;P&#x5E27;&#x3002;<br>1)P&#x5E27;&#x662F;I&#x5E27;&#x540E;&#x9762;&#x76F8;&#x9694;1~2&#x5E27;&#x7684;&#x7F16;&#x7801;&#x5E27;;<br>2)P&#x5E27;&#x91C7;&#x7528;&#x8FD0;&#x52A8;&#x8865;&#x507F;&#x7684;&#x65B9;&#x6CD5;&#x4F20;&#x9001;&#x5B83;&#x4E0E;&#x524D;&#x9762;&#x7684;I&#x6216;P&#x5E27;&#x7684;&#x5DEE;&#x503C;&#x53CA;&#x8FD0;&#x52A8;&#x77E2;&#x91CF;(&#x9884;&#x6D4B;&#x8BEF;&#x5DEE;);<br>3)&#x89E3;&#x7801;&#x65F6;&#x5FC5;&#x987B;&#x5C06;I&#x5E27;&#x4E2D;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x4E0E;&#x9884;&#x6D4B;&#x8BEF;&#x5DEE;&#x6C42;&#x548C;&#x540E;&#x624D;&#x80FD;&#x91CD;&#x6784;&#x5B8C;&#x6574;&#x7684;P&#x5E27;&#x56FE;&#x50CF;;<br>4)P&#x5E27;&#x5C5E;&#x4E8E;&#x524D;&#x5411;&#x9884;&#x6D4B;&#x7684;&#x5E27;&#x95F4;&#x7F16;&#x7801;&#x3002;&#x5B83;&#x53EA;&#x53C2;&#x8003;&#x524D;&#x9762;&#x6700;&#x9760;&#x8FD1;&#x5B83;&#x7684;I&#x5E27;&#x6216;P&#x5E27;;<br>5)P&#x5E27;&#x53EF;&#x4EE5;&#x662F;&#x5176;&#x540E;&#x9762;P&#x5E27;&#x7684;&#x53C2;&#x8003;&#x5E27;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5176;&#x524D;&#x540E;&#x7684;B&#x5E27;&#x7684;&#x53C2;&#x8003;&#x5E27;;<br>6)&#x7531;&#x4E8E;P&#x5E27;&#x662F;&#x53C2;&#x8003;&#x5E27;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x89E3;&#x7801;&#x9519;&#x8BEF;&#x7684;&#x6269;&#x6563;;<br>7)&#x7531;&#x4E8E;&#x662F;&#x5DEE;&#x503C;&#x4F20;&#x9001;&#xFF0C;P&#x5E27;&#x7684;&#x538B;&#x7F29;&#x6BD4;&#x8F83;&#x9AD8;&#x3002;<br>B&#x5E27;<br>&#x53CC;&#x5411;&#x9884;&#x6D4B;&#x5185;&#x63D2;&#x7F16;&#x7801;&#x5E27;&#x3002;B&#x5E27;&#x662F;&#x53CC;&#x5411;&#x5DEE;&#x522B;&#x5E27;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;B&#x5E27;&#x8BB0;&#x5F55;&#x7684;&#x662F;&#x672C;&#x5E27;&#x4E0E;&#x524D;&#x540E;&#x5E27;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x8981;&#x89E3;&#x7801;B&#x5E27;&#xFF0C;&#x4E0D;&#x4EC5;&#x8981;&#x53D6;&#x5F97;&#x4E4B;&#x524D;&#x7684;&#x7F13;&#x5B58;&#x753B;&#x9762;&#xFF0C;&#x8FD8;&#x8981;&#x89E3;&#x7801;&#x4E4B;&#x540E;&#x7684;&#x753B;&#x9762;&#xFF0C;&#x901A;&#x8FC7;&#x524D;&#x540E;&#x753B;&#x9762;&#x7684;&#x4E0E;&#x672C;&#x5E27;&#x6570;&#x636E;&#x7684;&#x53E0;&#x52A0;&#x53D6;&#x5F97;&#x6700;&#x7EC8;&#x7684;&#x753B;&#x9762;&#x3002;B&#x5E27;&#x538B;&#x7F29;&#x7387;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x89E3;&#x7801;&#x65F6;CPU&#x4F1A;&#x6BD4;&#x8F83;&#x7D2F;&#x3002;<br>B&#x5E27;&#x7684;&#x9884;&#x6D4B;&#x4E0E;&#x91CD;&#x6784;&#xFF1A;B&#x5E27;&#x4EE5;&#x524D;&#x9762;&#x7684;I&#x6216;P&#x5E27;&#x548C;&#x540E;&#x9762;&#x7684;P&#x5E27;&#x4E3A;&#x53C2;&#x8003;&#x5E27;,&#x201C;&#x627E;&#x51FA;&#x201D;B&#x5E27;&#x201C;&#x67D0;&#x70B9;&#x201D;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x548C;&#x4E24;&#x4E2A;&#x8FD0;&#x52A8;&#x77E2;&#x91CF;,&#x5E76;&#x53D6;&#x9884;&#x6D4B;&#x5DEE;&#x503C;&#x548C;&#x8FD0;&#x52A8;&#x77E2;&#x91CF;&#x4F20;&#x9001;&#x3002;&#x63A5;&#x6536;&#x7AEF;&#x6839;&#x636E;&#x8FD0;&#x52A8;&#x77E2;&#x91CF;&#x5728;&#x4E24;&#x4E2A;&#x53C2;&#x8003;&#x5E27;&#x4E2D;&#x201C;&#x627E;&#x51FA;(&#x7B97;&#x51FA;)&#x201D;&#x9884;&#x6D4B;&#x503C;&#x5E76;&#x4E0E;&#x5DEE;&#x503C;&#x6C42;&#x548C;,&#x5F97;&#x5230;B&#x5E27;&#x201C;&#x67D0;&#x70B9;&#x201D;&#x6837;&#x503C;,&#x4ECE;&#x800C;&#x53EF;&#x5F97;&#x5230;&#x5B8C;&#x6574;&#x7684;B&#x5E27;&#x3002;<br>1&#xFF09;B&#x5E27;&#x662F;&#x7531;&#x524D;&#x9762;&#x7684;I&#x6216;P&#x5E27;&#x548C;&#x540E;&#x9762;&#x7684;P&#x5E27;&#x6765;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x7684;;<br>2&#xFF09;B&#x5E27;&#x4F20;&#x9001;&#x7684;&#x662F;&#x5B83;&#x4E0E;&#x524D;&#x9762;&#x7684;I&#x6216;P&#x5E27;&#x548C;&#x540E;&#x9762;&#x7684;P&#x5E27;&#x4E4B;&#x95F4;&#x7684;&#x9884;&#x6D4B;&#x8BEF;&#x5DEE;&#x53CA;&#x8FD0;&#x52A8;&#x77E2;&#x91CF;;<br>3&#xFF09;B&#x5E27;&#x662F;&#x53CC;&#x5411;&#x9884;&#x6D4B;&#x7F16;&#x7801;&#x5E27;;<br>4&#xFF09;B&#x5E27;&#x538B;&#x7F29;&#x6BD4;&#x6700;&#x9AD8;,&#x56E0;&#x4E3A;&#x5B83;&#x53EA;&#x53CD;&#x6620;&#x4E19;&#x53C2;&#x8003;&#x5E27;&#x95F4;&#x8FD0;&#x52A8;&#x4E3B;&#x4F53;&#x7684;&#x53D8;&#x5316;&#x60C5;&#x51B5;,&#x9884;&#x6D4B;&#x6BD4;&#x8F83;&#x51C6;&#x786E;;<br>5&#xFF09;B&#x5E27;&#x4E0D;&#x662F;&#x53C2;&#x8003;&#x5E27;,&#x4E0D;&#x4F1A;&#x9020;&#x6210;&#x89E3;&#x7801;&#x9519;&#x8BEF;&#x7684;&#x6269;&#x6563;&#x3002;<br>       I&#x3001;B&#x3001;P&#x5404;&#x5E27;&#x662F;&#x6839;&#x636E;&#x538B;&#x7F29;&#x7B97;&#x6CD5;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x662F;&#x4EBA;&#x4E3A;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x5B9E;&#x5B9E;&#x5728;&#x5728;&#x7684;&#x7269;&#x7406;&#x5E27;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;I&#x5E27;&#x7684;&#x538B;&#x7F29;&#x7387;&#x662F;7&#xFF0C;P&#x5E27;&#x662F;20&#xFF0C;B&#x5E27;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;50&#x3002;&#x53EF;&#x89C1;&#x4F7F;&#x7528;B&#x5E27;&#x80FD;&#x8282;&#x7701;&#x5927;&#x91CF;&#x7A7A;&#x95F4;&#xFF0C;&#x8282;&#x7701;&#x51FA;&#x6765;&#x7684;&#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x591A;&#x4E00;&#x4E9B;I&#x5E27;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x76F8;&#x540C;&#x7801;&#x7387;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x66F4;&#x597D;&#x7684;&#x753B;&#x8D28;&#x3002;<br>       &#x5728;&#x89C6;&#x9891;&#x7F16;&#x7801;&#x5E8F;&#x5217;&#x4E2D;&#xFF0C;GOP&#x5373;Group of Picture&#xFF08;&#x56FE;&#x50CF;&#x7EC4;&#xFF09;&#xFF0C;&#x6307;&#x4E24;&#x4E2A;I&#x5E27;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;Reference&#xFF08;&#x53C2;&#x8003;&#x5468;&#x671F;&#xFF09;&#x6307;&#x4E24;&#x4E2A;P&#x5E27;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x3002;&#x4E00;&#x4E2A;I&#x5E27;&#x6240;&#x5360;&#x7528;&#x7684;&#x5B57;&#x8282;&#x6570;&#x5927;&#x4E8E;&#x4E00;&#x4E2A;P&#x5E27;&#xFF0C;&#x4E00;&#x4E2A;P&#x5E27;&#x6240;&#x5360;&#x7528;&#x7684;&#x5B57;&#x8282;&#x6570;&#x5927;&#x4E8E;&#x4E00;&#x4E2A;B&#x5E27;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x7801;&#x7387;&#x4E0D;&#x53D8;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;GOP&#x503C;&#x8D8A;&#x5927;&#xFF0C;P&#x3001;B&#x5E27;&#x7684;&#x6570;&#x91CF;&#x4F1A;&#x8D8A;&#x591A;&#xFF0C;&#x753B;&#x9762;&#x7EC6;&#x8282;&#x66F4;&#x591A;&#xFF0C;&#x4E5F;&#x5C31;&#x66F4;&#x5BB9;&#x6613;&#x83B7;&#x53D6;&#x8F83;&#x597D;&#x7684;&#x56FE;&#x50CF;&#x8D28;&#x91CF;&#xFF1B;Reference&#x8D8A;&#x5927;&#xFF0C;B&#x5E27;&#x7684;&#x6570;&#x91CF;&#x8D8A;&#x591A;&#xFF0C;&#x540C;&#x7406;&#x4E5F;&#x66F4;&#x5BB9;&#x6613;&#x83B7;&#x5F97;&#x8F83;&#x597D;&#x7684;&#x56FE;&#x50CF;&#x8D28;&#x91CF;&#x3002;<br>       &#x7531;&#x4E8E;P&#x3001;B&#x5E27;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x5927;&#x4E8E;I&#x5E27;&#xFF0C;&#x6240;&#x4EE5;&#x8FC7;&#x591A;&#x7684;P&#x3001;B&#x5E27;&#x4F1A;&#x5F71;&#x54CD;&#x7F16;&#x7801;&#x6548;&#x7387;&#xFF0C;&#x4F7F;&#x7F16;&#x7801;&#x6548;&#x7387;&#x964D;&#x4F4E;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x8FC7;&#x957F;&#x7684;GOP&#x8FD8;&#x4F1A;&#x5F71;&#x54CD;Seek&#x64CD;&#x4F5C;&#xFF08;&#x627E;I&#x5E27;&#xFF09;&#x7684;&#x54CD;&#x5E94;&#x901F;&#x5EA6;&#xFF0C;&#x7531;&#x4E8E;P&#x3001;B&#x5E27;&#x662F;&#x7531;&#x524D;&#x9762;&#x7684;I&#x6216;P&#x5E27;&#x9884;&#x6D4B;&#x5F97;&#x5230;&#x7684;&#xFF0C;&#x6240;&#x4EE5;Seek&#x64CD;&#x4F5C;&#x9700;&#x8981;&#x76F4;&#x63A5;&#x5B9A;&#x4F4D;&#xFF0C;&#x89E3;&#x7801;&#x67D0;&#x4E00;&#x4E2A;P&#x6216;B&#x5E27;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x89E3;&#x7801;&#x5F97;&#x5230;&#x672C;GOP&#x5185;&#x7684;I&#x5E27;&#x53CA;&#x4E4B;&#x524D;&#x7684;N&#x4E2A;&#x9884;&#x6D4B;&#x5E27;&#x624D;&#x53EF;&#x4EE5;&#xFF0C;GOP&#x503C;&#x8D8A;&#x957F;&#xFF0C;&#x9700;&#x8981;&#x89E3;&#x7801;&#x7684;&#x9884;&#x6D4B;&#x5E27;&#x5C31;&#x8D8A;&#x591A;&#xFF0C;seek&#x54CD;&#x5E94;&#x7684;&#x65F6;&#x95F4;&#x4E5F;&#x8D8A;&#x957F;&#x3002;  &#x5047;&#x8BBE;I&#x5E27;&#x635F;&#x574F;&#xFF0C;&#x90A3;&#x4E48;&#x6574;&#x4E2A;GOP&#x7ED3;&#x6784;&#x5C31;&#x574F;&#x6389;&#x4E86;&#xFF0C;&#x8BBE;&#x7F6E;&#x8FC7;&#x957F;&#x7684;&#x95F4;&#x9694;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4;&#x7F16;&#x7801;&#x540E;&#x7684;&#x89C6;&#x9891;&#x4E0D;&#x7A33;&#x5B9A;&#x3002;<br>       &#x4E00;&#x4E2A; I &#x5E27;&#x53EF;&#x4EE5;&#x4E0D;&#x4F9D;&#x8D56;&#x5176;&#x4ED6;&#x5E27;&#x5C31;&#x89E3;&#x7801;&#x51FA;&#x4E00;&#x5E45;&#x5B8C;&#x6574;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x800C; P &#x5E27;&#x3001;B &#x5E27;&#x4E0D;&#x884C;&#x3002;P &#x5E27;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x89C6;&#x9891;&#x6D41;&#x4E2D;&#x6392;&#x5728;&#x5B83;&#x524D;&#x9762;&#x7684;&#x5E27;&#x624D;&#x80FD;&#x89E3;&#x7801;&#x51FA;&#x56FE;&#x50CF;&#x3002;B &#x5E27;&#x5219;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x89C6;&#x9891;&#x6D41;&#x4E2D;&#x6392;&#x5728;&#x5B83;&#x524D;&#x9762;&#x6216;&#x540E;&#x9762;&#x7684;&#x5E27;&#x624D;&#x80FD;&#x89E3;&#x7801;&#x51FA;&#x56FE;&#x50CF;&#x3002;<br>       &#x8FD9;&#x5C31;&#x5E26;&#x6765;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x5728;&#x89C6;&#x9891;&#x6D41;&#x4E2D;&#xFF0C;&#x5148;&#x5230;&#x6765;&#x7684; B &#x5E27;&#x65E0;&#x6CD5;&#x7ACB;&#x5373;&#x89E3;&#x7801;&#xFF0C;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x5B83;&#x4F9D;&#x8D56;&#x7684;&#x540E;&#x9762;&#x7684;P &#x5E27;&#x5148;&#x89E3;&#x7801;&#x5B8C;&#x6210;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#x64AD;&#x653E;&#x65F6;&#x95F4;&#x4E0E;&#x89E3;&#x7801;&#x65F6;&#x95F4;&#x4E0D;&#x4E00;&#x81F4;&#x4E86;&#xFF0C;&#x987A;&#x5E8F;&#x6253;&#x4E71;&#x4E86;&#xFF0C;&#x90A3;&#x8FD9;&#x4E9B;&#x5E27;&#x8BE5;&#x5982;&#x4F55;&#x64AD;&#x653E;&#x5462;&#xFF1F;&#x8FD9;&#x65F6;&#x5C31;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x6765;&#x4E86;&#x89E3;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF1A;DTS &#x548C; PTS&#x3002;</p>
<pre><code>DTS&#x548C;PTS 

DTS&#xFF08;Decoding Time Stamp&#xFF09;&#xFF1A;&#x5373;&#x89E3;&#x7801;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#x7684;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#x544A;&#x8BC9;&#x64AD;&#x653E;&#x5668;&#x8BE5;&#x5728;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x89E3;&#x7801;&#x8FD9;&#x4E00;&#x5E27;&#x7684;&#x6570;&#x636E;&#x3002;
PTS&#xFF08;Presentation Time Stamp&#xFF09;&#xFF1A;&#x5373;&#x663E;&#x793A;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#x7528;&#x6765;&#x544A;&#x8BC9;&#x64AD;&#x653E;&#x5668;&#x8BE5;&#x5728;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x663E;&#x793A;&#x8FD9;&#x4E00;&#x5E27;&#x7684;&#x6570;&#x636E;&#x3002;
&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF1A;&#x867D;&#x7136; DTS&#x3001;PTS &#x662F;&#x7528;&#x4E8E;&#x6307;&#x5BFC;&#x64AD;&#x653E;&#x7AEF;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x662F;&#x5728;&#x7F16;&#x7801;&#x7684;&#x65F6;&#x5019;&#x7531;&#x7F16;&#x7801;&#x5668;&#x751F;&#x6210;&#x7684;&#x3002;
&#x5F53;&#x89C6;&#x9891;&#x6D41;&#x4E2D;&#x6CA1;&#x6709; B &#x5E27;&#x65F6;&#xFF0C;&#x901A;&#x5E38; DTS &#x548C; PTS &#x7684;&#x987A;&#x5E8F;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x4F46;&#x5982;&#x679C;&#x6709; B &#x5E27;&#x65F6;&#xFF0C;&#x89E3;&#x7801;&#x987A;&#x5E8F;&#x548C;&#x64AD;&#x653E;&#x987A;&#x5E8F;&#x5C31;&#x4E0D;&#x4E00;&#x81F4;&#x4E86;&#x3002;
&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x5E27;&#x7684;&#x663E;&#x793A;&#x987A;&#x5E8F;&#x662F;&#xFF1A;I B B P&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x89E3;&#x7801; B &#x5E27;&#x65F6;&#x77E5;&#x9053; P &#x5E27;&#x4E2D;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x51E0;&#x5E27;&#x5728;&#x89C6;&#x9891;&#x6D41;&#x4E2D;&#x7684;&#x987A;&#x5E8F;&#x53EF;&#x80FD;&#x662F;&#xFF1A;I P B B&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x4F53;&#x73B0;&#x51FA;&#x6BCF;&#x5E27;&#x90FD;&#x6709; DTS &#x548C; PTS &#x7684;&#x4F5C;&#x7528;&#x4E86;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x987A;&#x5E8F;&#x5927;&#x6982;&#x5982;&#x4E0B;&#xFF1A;



&#x97F3;&#x89C6;&#x9891;&#x540C;&#x6B65;

&#x4E0A;&#x9762;&#x8BF4;&#x4E86;DTS&#x3001;PTS &#x76F8;&#x5173;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x5A92;&#x4F53;&#x6D41;&#x4E2D;&#xFF0C;&#x9664;&#x4E86;&#x89C6;&#x9891;&#x4EE5;&#x5916;&#xFF0C;&#x901A;&#x5E38;&#x8FD8;&#x5305;&#x62EC;&#x97F3;&#x9891;&#x3002;&#x97F3;&#x9891;&#x7684;&#x64AD;&#x653E;&#xFF0C;&#x4E5F;&#x6709; DTS&#x3001;PTS &#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4F46;&#x662F;&#x97F3;&#x9891;&#x6CA1;&#x6709;&#x7C7B;&#x4F3C;&#x89C6;&#x9891;&#x4E2D; B &#x5E27;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x53CC;&#x5411;&#x9884;&#x6D4B;&#xFF0C;&#x6240;&#x4EE5;&#x97F3;&#x9891;&#x5E27;&#x7684; DTS&#x3001;PTS &#x987A;&#x5E8F;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x97F3;&#x9891;&#x89C6;&#x9891;&#x6DF7;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x64AD;&#x653E;&#xFF0C;&#x5C31;&#x5448;&#x73B0;&#x4E86;&#x5B8C;&#x6574;&#x7684;&#x89C6;&#x9891;&#x3002;&#x5728;&#x97F3;&#x89C6;&#x9891;&#x4E00;&#x8D77;&#x64AD;&#x653E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x9700;&#x8981;&#x9762;&#x4E34;&#x600E;&#x4E48;&#x53BB;&#x540C;&#x6B65;&#x5B83;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x514D;&#x51FA;&#x73B0;&#x97F3;&#x753B;&#x4E0D;&#x540C;&#x6B65;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8981;&#x5B9E;&#x73B0;&#x97F3;&#x89C6;&#x9891;&#x540C;&#x6B65;&#xFF0C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x53C2;&#x8003;&#x65F6;&#x949F;&#xFF0C;&#x53C2;&#x8003;&#x65F6;&#x949F;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x7EBF;&#x6027;&#x9012;&#x589E;&#x7684;&#xFF0C;&#x7F16;&#x7801;&#x97F3;&#x89C6;&#x9891;&#x6D41;&#x65F6;&#x4F9D;&#x636E;&#x53C2;&#x8003;&#x65F6;&#x949F;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x7ED9;&#x6BCF;&#x5E27;&#x6570;&#x636E;&#x6253;&#x4E0A;&#x65F6;&#x95F4;&#x6233;&#x3002;&#x5728;&#x64AD;&#x653E;&#x65F6;&#xFF0C;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x5E27;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x540C;&#x65F6;&#x53C2;&#x8003;&#x5F53;&#x524D;&#x53C2;&#x8003;&#x65F6;&#x949F;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x5B89;&#x6392;&#x64AD;&#x653E;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x8BF4;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x8BF4;&#x7684; PTS&#x3002;
</code></pre><p>&#x538B;&#x7F29;&#x7B97;&#x6CD5;<br>H.264&#x7684;&#x538B;&#x7F29;&#x65B9;&#x6CD5;<br>       1.&#x5206;&#x7EC4;:&#x628A;&#x51E0;&#x5E27;&#x56FE;&#x50CF;&#x5206;&#x4E3A;&#x4E00;&#x7EC4;(GOP&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;)&#xFF0C;&#x4E3A;&#x9632;&#x6B62;&#x8FD0;&#x52A8;&#x53D8;&#x5316;&#xFF0C;&#x5E27;&#x6570;&#x4E0D;&#x5B9C;&#x53D6;&#x591A;&#x3002;<br>       2.&#x5B9A;&#x4E49;&#x5E27;:&#x5C06;&#x6BCF;&#x7EC4;&#x5185;&#x5404;&#x5E27;&#x56FE;&#x50CF;&#x5B9A;&#x4E49;&#x4E3A;&#x4E09;&#x79CD;&#x7C7B;&#x578B;,&#x5373;I&#x5E27;&#x3001;B&#x5E27;&#x548C;P&#x5E27;;<br>       3.&#x9884;&#x6D4B;&#x5E27;:&#x4EE5;I&#x5E27;&#x505A;&#x4E3A;&#x57FA;&#x7840;&#x5E27;,&#x4EE5;I&#x5E27;&#x9884;&#x6D4B;P&#x5E27;,&#x518D;&#x7531;I&#x5E27;&#x548C;P&#x5E27;&#x9884;&#x6D4B;B&#x5E27;;<br>       4.&#x6570;&#x636E;&#x4F20;&#x8F93;:&#x6700;&#x540E;&#x5C06;I&#x5E27;&#x6570;&#x636E;&#x4E0E;&#x9884;&#x6D4B;&#x7684;&#x5DEE;&#x503C;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x548C;&#x4F20;&#x8F93;&#x3002;<br>&#x5E27;&#x5185;&#x538B;&#x7F29;&#x548C;&#x5E27;&#x95F4;&#x538B;&#x7F29;<br>       &#x5E27;&#x5185;&#xFF08;Intraframe&#xFF09;&#x538B;&#x7F29;&#x4E5F;&#x79F0;&#x4E3A;&#x7A7A;&#x95F4;&#x538B;&#x7F29;&#x3002;&#x5F53;&#x538B;&#x7F29;&#x4E00;&#x5E27;&#x56FE;&#x50CF;&#x65F6;&#xFF0C;&#x4EC5;&#x8003;&#x8651;&#x672C;&#x5E27;&#x7684;&#x6570;&#x636E;&#x800C;&#x4E0D;&#x8003;&#x8651;&#x76F8;&#x90BB;&#x5E27;&#x4E4B;&#x95F4;&#x7684;&#x5197;&#x4F59;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x4E0E;&#x9759;&#x6001;&#x56FE;&#x50CF;&#x538B;&#x7F29;&#x7C7B;&#x4F3C;&#x3002;&#x5E27;&#x5185;&#x4E00;&#x822C;&#x91C7;&#x7528;&#x6709;&#x635F;&#x538B;&#x7F29;&#x7B97;&#x6CD5;&#xFF0C;&#x7531;&#x4E8E;&#x5E27;&#x5185;&#x538B;&#x7F29;&#x662F;&#x7F16;&#x7801;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x7684;&#x89E3;&#x7801;&#x3001;&#x663E;&#x793A;&#x3002;&#x5E27;&#x5185;&#x538B;&#x7F29;&#x4E00;&#x822C;&#x8FBE;&#x4E0D;&#x5230;&#x5F88;&#x9AD8;&#x7684;&#x538B;&#x7F29;&#x3002;&#x3000;&#x3000;<br>       &#x5E27;&#x95F4;&#xFF08;Interframe&#xFF09;&#x538B;&#x7F29;&#x7684;&#x539F;&#x7406;&#x662F;&#xFF1A;&#x76F8;&#x90BB;&#x51E0;&#x5E27;&#x7684;&#x6570;&#x636E;&#x6709;&#x5F88;&#x5927;&#x7684;&#x76F8;&#x5173;&#x6027;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x524D;&#x540E;&#x4E24;&#x5E27;&#x4FE1;&#x606F;&#x53D8;&#x5316;&#x5F88;&#x5C0F;&#x7684;&#x7279;&#x70B9;&#x3002;&#x4E5F;&#x5373;&#x8FDE;&#x7EED;&#x7684;&#x89C6;&#x9891;&#x5176;&#x76F8;&#x90BB;&#x5E27;&#x4E4B;&#x95F4;&#x5177;&#x6709;&#x5197;&#x4F59;&#x4FE1;&#x606F;,&#x6839;&#x636E;&#x8FD9;&#x4E00;&#x7279;&#x6027;&#xFF0C;&#x538B;&#x7F29;&#x76F8;&#x90BB;&#x5E27;&#x4E4B;&#x95F4;&#x7684;&#x5197;&#x4F59;&#x91CF;&#x5C31;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;&#x538B;&#x7F29;&#x91CF;&#xFF0C;&#x51CF;&#x5C0F;&#x538B;&#x7F29;&#x6BD4;&#x3002;&#x5E27;&#x95F4;&#x538B;&#x7F29;&#x4E5F;&#x79F0;&#x4E3A;&#x65F6;&#x95F4;&#x538B;&#x7F29;&#xFF08;Temporal compression&#xFF09;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x6BD4;&#x8F83;&#x65F6;&#x95F4;&#x8F74;&#x4E0A;&#x4E0D;&#x540C;&#x5E27;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x538B;&#x7F29;&#x3002;&#x5E27;&#x95F4;&#x538B;&#x7F29;&#x4E00;&#x822C;&#x662F;&#x65E0;&#x635F;&#x7684;&#x3002;&#x5E27;&#x5DEE;&#x503C;&#xFF08;Frame differencing&#xFF09;&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x5178;&#x578B;&#x7684;&#x65F6;&#x95F4;&#x538B;&#x7F29;&#x6CD5;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x6BD4;&#x8F83;&#x672C;&#x5E27;&#x4E0E;&#x76F8;&#x90BB;&#x5E27;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x4EC5;&#x8BB0;&#x5F55;&#x672C;&#x5E27;&#x4E0E;&#x5176;&#x76F8;&#x90BB;&#x5E27;&#x7684;&#x5DEE;&#x503C;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x6570;&#x636E;&#x91CF;&#x3002;  </p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2017-10-30T14:09:59.938Z" itemprop="datePublished">2017-10-30</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a href="/2018/08/09/李娟娟简历/" class="ui tiny button">

                    <i class="angle left icon"></i>
                    
                    李娟娟作品集
                    

                </a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/2017/09/21/java动态代理/" class="ui tiny button">
                    
                    java动态代理
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    
                </div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2018 <a href="/">陈华榕</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a
                href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/js/semantic-ui-algolia.js"></script>

<script src="/js/aloha-events.js"></script>



</body>
</html>
